{
  "url": "https://jobs.bytedance.com/en/position?keywords=&category=&location=CT_157&project=7322364513776093449&type=2&job_hot_flag=&current=1&limit=10&functionCategory=&tag=",
  "contentHash": "6c600e1c99cc88e8dfe6f2c34575f28d",
  "content": "Find Your New Job (8)Research Engineer Graduate (Vision AI Platform - Seattle）- 2025 Start (BS/MS)SeattleRegularR&D - Computer visionBachelor/Master Graduates- 2025 StartJob ID: A240137Established in 2023, the ByteDance Doubao (Seed) Team is dedicated to building industry-leading AI foundation models. We aim to do world-leading research and foster both technological and social progress.\n\nWith a long-term vision and a strong commitment to the AI field, the Team conducts research in a range of areas including natural language processing (NLP), computer vision (CV), and speech recognition and generation. It has labs and researcher roles in China, Singapore, and the US.\n\nLeveraging substantial data and computing resources and through continued investment in these domains, our team has built a proprietary general-purpose model with multimodal capabilities. In the Chinese market, Doubao models power over 50 ByteDance apps and business lines, including Doubao, Coze, and Dreamina, and was launched to external enterprise clients through Volcano Engine. The Doubao app is the most used AIGC app in China. \n\nWhy Join Us\nCreation is the core of ByteDance's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt ByteDance, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nAbout the Team\nWelcome to the Doubao Vision team, where we spearhead multi-modality foundation models on visual understanding and visual generation. Our mission is to solve the visual intelligence problem for AI. We conduct cutting-edge research on areas like vision and language, large vision models, and generative foundation models. The team is a mix of experienced research scientists and engineers, aiming to advance the research boundaries in foundation models and apply our technologies to our rich application scenarios, whereas a feedback loop is created to help further improve our foundation technologies. Join us in shaping the future of AI technologies and revolutionizing our product experience for global users.\n\nResponsibilities\n-Creating AI engineering infrastructure from end to end for large model development\n-Training inference acceleration and deploymentFrontend Software Engineer Graduate (Global E-commerce-US) - 2025 Start (BS/MS)SeattleRegularR&D - FrontendBachelor/Master Graduates- 2025 StartJob ID: A38971AFounded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok, Helo, and Resso, as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content. \n\nWhy Join Us\nCreation is the core of ByteDance's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt ByteDance, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nTeam Introduction\nGlobal E-Commerce Team is a content e-commerce business with international short video products as the carrier. It is committed to becoming the first choice for users to discover and purchase good products at affordable prices. The global e-commerce business team hopes to provide users with a more tailored and efficient consumption experience, enabling merchants to receive reliable platform services in different scenarios such as live e-commerce, and short video content e-commerce, so as to make more affordable and high-quality products sell easily and a better life within reach. \n\nWe are looking for talented individuals to join our team in 2025. As a graduate, you will get unparalleled opportunities for you to kickstart your career, pursue bold ideas and explore limitless growth opportunities. Co-create a future driven by your inspiration with ByteDance.\n\nSuccessful candidates must be able to commit to an onboarding date by end of year 2025.\n\nWe will prioritize candidates who are able to commit to these start dates. Please state your availability and graduation date clearly in your resume.\n\nApplications will be reviewed on a rolling basis. We encourage you to apply early.\n\nCandidates can apply for a maximum of TWO positions and will be considered for jobs in the order you applied for. The application limit is applicable to ByteDance and its affiliates' jobs globally. \n\nOnline Assessment \nCandidates who pass resume evaluation will be invited to participate in ByteDance's technical online assessment through HackerRank.\n\nResponsibilities:\n- Develop efficient and highly reusable front-end systems that drive complex web applications for e-commerce products.\n- Code optimization to improve scalability, reliability, security and performance of web applications.\n- Collaborate with product design, product management and software engineering teams to deliver best in class user experience.Software Development Engineer in Test Graduate (Global E-commerce-US) - 2025 Start (BS/MS)SeattleRegularR&D - TestingBachelor/Master Graduates- 2025 StartJob ID: A221451Founded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok, Helo, and Resso, as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content. \n\nWhy Join Us\nCreation is the core of ByteDance's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt ByteDance, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nTeam Introduction\nGlobal E-Commerce Team is a content e-commerce business with international short video products as the carrier. It is committed to becoming the first choice for users to discover and purchase good products at affordable prices. The global e-commerce business team hopes to provide users with a more tailored and efficient consumption experience, enabling merchants to receive reliable platform services in different scenarios such as live e-commerce, and short video content e-commerce, so as to make more affordable and high-quality products sell easily and a better life within reach. \n\nWe are looking for talented individuals to join our team in 2025. As a graduate, you will get unparalleled opportunities for you to kickstart your career, pursue bold ideas and explore limitless growth opportunities. Co-create a future driven by your inspiration with ByteDance.\n\nSuccessful candidates must be able to commit to an onboarding date by end of year 2025.\n\nWe will prioritize candidates who are able to commit to these start dates. Please state your availability and graduation date clearly in your resume.\n\nApplications will be reviewed on a rolling basis. We encourage you to apply early.\n\nCandidates can apply for a maximum of TWO positions and will be considered for jobs in the order you applied for. The application limit is applicable to ByteDance and its affiliates' jobs globally. \n\nOnline Assessment \nCandidates who pass resume evaluation will be invited to participate in ByteDance's technical online assessment through HackerRank.\n\nResponsibilities:\n- Work alongside developers as well as business stakeholders and strive to automate the acceptance criteria.\n- Responsible for building robust, and high–quality test automation solutions for functional, regression, and performance testing.\n- Participate in PRD review and architectural design review. Be aware of the business logic, system architecture, and inner functioning of the product.\n- Responsible for automating test cases as well as writing reusable scripts/tools that help the team to reduce repetitive efforts.\n- Proactive to identify the efficiency bottleneck, research and improve process, tools, framework, etc.Backend Software Engineer Graduate (Global E-commerce-US) - 2025 Start (BS/MS)SeattleRegularR&DBachelor/Master Graduates- 2025 StartJob ID: A161374Founded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok, Helo, and Resso, as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content. \n\nWhy Join Us\nCreation is the core of ByteDance's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt ByteDance, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nTeam Introduction\nGlobal E-Commerce Team is a content e-commerce business with international short video products as the carrier. It is committed to becoming the first choice for users to discover and purchase good products at affordable prices. The global e-commerce business team hopes to provide users with a more tailored and efficient consumption experience, enabling merchants to receive reliable platform services in different scenarios such as live e-commerce, and short video content e-commerce, so as to make more affordable and high-quality products sell easily and a better life within reach. \n\nWe are looking for talented individuals to join our team in 2025. As a graduate, you will get unparalleled opportunities for you to kickstart your career, pursue bold ideas and explore limitless growth opportunities. Co-create a future driven by your inspiration with ByteDance.\n\nSuccessful candidates must be able to commit to an onboarding date by end of year 2025.\n\nWe will prioritize candidates who are able to commit to these start dates. Please state your availability and graduation date clearly in your resume.\n\nApplications will be reviewed on a rolling basis. We encourage you to apply early.\n\nCandidates can apply for a maximum of TWO positions and will be considered for jobs in the order you applied for. The application limit is applicable to ByteDance and its affiliates' jobs globally. \n\nOnline Assessment \nCandidates who pass resume evaluation will be invited to participate in ByteDance's technical online assessment through HackerRank.\n\nResponsibilities:\n- Develop efficient, highly scalable and secured services that power e-commerce products. \n- Optimize backend systems and services for data security, modularity, computational efficiency and scalability. \n- Design and develop data services and analytics platforms for e-commerce applications. \n- Develop best-in-class user privacy and data security engineering practices across all product engineering disciplines.Software Development Engineer Graduate (Distributed NoSQL Database Systems ) - 2025 Start (BS/MS)SeattleRegularR&D - InfrastructureBachelor/Master Graduates- 2025 StartJob ID: A27059About ByteDance\nFounded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content. \n\nWhy Join Us\nCreation is the core of ByteDance's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt ByteDance, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nAbout the Team\nJoin ByteDance’s database development team, where you’ll build and own cutting-edge database products supporting Bytedance’s global infrastructure. Our diverse portfolio includes relational databases, distributed caches, key-value stores, document databases, graph databases, wide-column stores, search engines, and multi-model databases. In this role, you’ll have the opportunity to enhance these services in a cloud-native environment, embracing a culture of intellectual curiosity, self-direction, and problem-solving.\n\nSuccessful candidates must be able to commit to an onboarding date by end of year 2025.\nWe will prioritize candidates who are able to commit to the company start dates. Please state your availability and graduation date clearly in your resume.\n\nApplications will be reviewed on a rolling basis. We encourage you to apply early.\nCandidates can apply for a maximum of TWO positions and will be considered for jobs in the order you applied for. The application limit is applicable to ByteDance and its affiliates' jobs globally. \n\nResponsibilities\n-  Design and develop distributed NoSQL databases, with a focus on one of the following:  distributed caches, key-value stores, document databases, graph databases, wide-column stores, search engines, or multi-model databases.\n-  Build high-performance, low-latency, and highly available distributed systems to support mission-critical business operations with scalability and cost efficiency.\n-  Optimize compute and storage engines for cloud-native global deployments, improving efficiency and reducing operational costs.\n-  Provide technical guidance to internal business teams, identifying opportunities for system optimization to improve stability, functionality, and performance.\n-  Collaborate with cross-functional teams to develop robust database products and solutions.\n-  Address technical challenges in cloud service architectures, ensuring scalable solutions for large-scale, high-traffic systems.Site Reliability Engineer Graduate (Technical Infrastructure) - 2025 Start (BS/MS)SeattleRegularR&D - InfrastructureBachelor/Master Graduates- 2025 StartJob ID: A176393Founded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok, Helo, and Resso, as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content. \n\nWhy Join Us\nCreation is the core of ByteDance's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt ByteDance, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nOur data infrastructure Site Reliability Engineering (SRE) team is a pioneer in innovation. We seamlessly merge software development and infrastructure operations to design, build, and manage large-scale, highly distributed systems.\n\nWe take pride in overseeing one of the industry's most extensive cloud infrastructures. As software development evolves, building systems from a mix of components has become the new standard. In this era, SRE takes a central role. This role demands the ability to design, develop, and operate these components, transforming them into cloud-managed, scalable, and reliable elements. Our professionals play a critical role as connectors, ensuring the seamless integration of these diverse components to deliver high-performing systems.\n\nOur SRE field is about actively shaping the future of technology, not just keeping pace with it. We contribute significantly to the next chapter of data infrastructure. We're currently in the process of building global teams around the world. Join us today and embark on this transformative journey!\n\nWe are looking for talented individuals to join our team in 2025. As a graduate, you will get unparalleled opportunities for you to kickstart your career, pursue bold ideas and explore limitless growth opportunities. Co-create a future driven by your inspiration with ByteDance.\n\nSuccessful candidates must be able to commit to an onboarding date by end of year 2025.\n\nWe will prioritize candidates who are able to commit to these start dates. Please state your availability and graduation date clearly in your resume.\n\nApplications will be reviewed on a rolling basis. We encourage you to apply early.\n\nCandidates can apply for a maximum of TWO positions and will be considered for jobs in the order you applied for. The application limit is applicable to ByteDance and its affiliates' jobs globally.\n\nOnline Assessment\nCandidates who pass resume evaluation will be invited to participate in ByteDance's technical online assessment through HackerRank.\n\nResponsibilities:\n- Participate in and enhance the complete service lifecycle, from inception and design, through development, capacity planning, launch reviews, deployment, operation, and refinement. \n- Design and implement software platforms and monitoring frameworks to govern service-oriented architecture (SOA) efficiently, automatically, and intelligently. \n- Develop and manage components of cloud-managed data infrastructure, encompassing technologies such as Kubernetes, Redis, MySQL, Flink, and more. \n- Establish sustainable mechanisms for scaling systems, such as automation, to drive enhancements in reliability, efficiency, and velocity. \n- Provide sustainable user support, manage incident responses, and conduct blameless postmortems as part of our ongoing efforts to improve our systems.Software Engineer Graduate (Multi Cloud CDN) - 2025 Start (BS/MS)SeattleRegularR&DBachelor/Master Graduates- 2025 StartJob ID: A231543Founded in 2012, ByteDance's mission is to inspire creativity and enrich life. With a suite of more than a dozen products, including TikTok as well as platforms specific to the China market, including Toutiao, Douyin, and Xigua, ByteDance has made it easier and more fun for people to connect with, consume, and create content. \n\nWhy Join Us\nCreation is the core of ByteDance's purpose. Our products are built to help imaginations thrive. This is doubly true of the teams that make our innovations possible. \nTogether, we inspire creativity and enrich life - a mission we aim towards achieving every day. \nTo us, every challenge, no matter how ambiguous, is an opportunity; to learn, to innovate, and to grow as one team. Status quo? Never. Courage? Always. \nAt ByteDance, we create together and grow together. That's how we drive impact - for ourselves, our company, and the users we serve. \nJoin us.\n\nTeam Introduction \nByteDance's Multi-Cloud CDN, you will be responsible for the architecture design, R&D, and continuous optimization of our Multi-Cloud CDN platform. This includes developing and optimizing systems for configuration management, data analysis, content management, and scheduling. Your work will ensure efficient business access and support flexible and configurable scheduling strategies to optimize TikTok's global traffic management.\n\nWe are looking for talented individuals to join our team in 2025. As a graduate, you will get unparalleled opportunities for you to kickstart your career, pursue bold ideas and explore limitless growth opportunities. Co-create a future driven by your inspiration with ByteDance.\nSuccessful candidates must be able to commit to an onboarding date by end of year 2025.\nWe will prioritize candidates who are able to commit to these start dates. Please state your availability and graduation date clearly in your resume. \n\nApplications will be reviewed on a rolling basis. We encourage you to apply as early as possible.\n\nCandidates can apply to a maximum of two positions and will be considered for jobs in the order you apply. The application limit is applicable to ByteDance and its affiliates' jobs globally. Applications will be reviewed on a rolling basis - we encourage you to apply early.\n\nOnline Assessment\nCandidates who pass resume evaluation will be invited to participate in ByteDance's technical online assessment through HackerRank.\n\nResponsibilities\n1. Assist in the architecture design and development of our Multi-Cloud CDN platform.\n2. Support the optimization and continuous improvement of systems for configuration management, data analysis, content management, and scheduling.\n3. Participate in developing tools and solutions to enhance business access efficiency and optimize TikTok's global traffic management.\n4. Collaborate with senior engineers to implement flexible and configurable scheduling strategies.\n5. Contribute to the maintenance and troubleshooting of the Multi-Cloud CDN platform to ensure smooth operation.\n6. Learn and apply best practices for Multi-Cloud CDN development and optimization.LLM Software Engineer/Researcher (Applied Machine Learning)- 2025 Start (MS)SeattleRegularR&DBachelor/Master Graduates- 2025 StartJob ID: A248372About the Team: \nThe Applied Machine Learning Enterprise team combines system engineering and machine learning to develop and operate big model service platform that offers businesses Model-as-a-Service solutions (MaaS) to both the big model vendors and users. We are actively seeking talented Software Engineers/Researchers specializing in Large Language Models (LLM) to join our dynamic team. \n\nResponsibilities:\nIn this role, you will be at the forefront of cutting-edge research and development of advanced techniques for MaaS solutions including model continuous pretraining, fine-tuning, evaluation, inference capabilities and also LLM application/agent development. Your primary responsibility will be to: \n- lead the creation of next-generation, high-capacity LLM platforms and innovative products. \n- work closely with cross-functional teams to plan and implement projects harnessing LLMs for diverse purposes and vertical domains. \n- Maintain a deep passion for contributing to the success of large models is essential in this innovative and fast-paced team environment.",
  "timestamp": "2025-03-24T20:20:29.307Z",
  "previousTimestamp": "2025-03-22T07:24:34.692Z"
}