{
  "url": "https://careers.redfin.com/us/en/search-results?keywords=washington%20software%20engineer",
  "contentHash": "0fdb6ed06cf3306ac9bc1f7870e111ad",
  "content": "Showing  11 results for \"washington software engineer\" 11 results foundNo result foundSearch within resultsGo1-10of11resultsSort by:RelevanceRecentjobs sorted by Most relevantFilterSoftware Engineer IIThe Data Ingestion and Infrastructure team builds infrastructure, pipelines, and platforms to help support and modernize large data processing that have made Redfin the most trusted real-estate site i...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 10th 2025Apply NowSoftware Engineer - Digital MarketingAs a Software Engineer - Digital Marketing, you will work on Redfin’s entire digital marketing platform: data pipelines with our partners, campaign management and bid optimization tools, automation of...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  February 2nd 2025Apply NowStaff Software Engineer - Data StreamingAs a Staff Software Engineer on the Data Streaming team you will be responsible for leading our strategy and implementation, while mentoring other engineers on the team. The team is responsible for da...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  February 9th 2025Apply NowSoftware Developer IIYou will develop responsive, resilient, scalable, and high-quality software using React, Java, AWS, and various other tools/libraries. You will collaborate with other engineering and product stakehold...Location : Seattle, Washington, United States of AmericaCategory : OtherJob Type : Full timePosted Date :  March 18th 2025Apply NowSenior Software Developer - Data IngestionAs a Sr Software Engineer - Data Ingestion you will work on Redfin’s data ingestion platform creating new data pipelines and tooling to help keep Redfin’s inventory updated faster and higher quality t...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 23rd 2025Apply NowSr. Cloud Infrastructure / DevOps Engineer - RemoteCloud Infrastructure / DevOps Engineer on our cloud compute team, you will help us to architect and build a platform that scales, while ensuring a secure, cost effective and reliable ecosystem. You wi...Available in 3 locationsAvailable in 3 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  January 27th 2025Apply NowAndroid Mobile Engineer - Latin America/South America BasedYou continually obsess over improving the user experience, whether it's collaborating with product managers and designers to build beautiful products or finding and squashing performance bottlenecks....Location : Seattle, Washington, United States of AmericaCategory : Engineering & ProductJob Type : Full timePosted Date :  March 20th 2025Apply NowSenior Product Manager, Search & SortYou’ll work with SEO managers to identify opportunities, designers to create new features; engineers to ship them, and analysts to measure their impact. You’ll draw wireframes and feature flows to com...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 2nd 2025Apply NowPartner Account Executive, Partner ProgramAs a Partner Account Executive for The Partner Program, you will utilize your sales and consultative expertise to identify, target, and convert potential listing agents, ultimately contributing to the...Location : Seattle, Washington, United States of AmericaCategory : Marketing & Business DevelopmentJob Type : Full timePosted Date :  March 2nd 2025Apply NowSenior Marketing Channel ManagerYou’ll work directly with an experienced performance marketing team and supporting resources across creative, engineering, analytics, and product to ensure direct mail campaigns are high-impact, and f...Location : Seattle, Washington, United States of AmericaCategory : Marketing & Business DevelopmentJob Type : Full timePosted Date :  February 27th 2025Apply NowPrev12Next",
  "timestamp": "2025-03-24T20:21:39.500Z",
  "previousTimestamp": "2025-03-22T22:21:56.156Z"
}