{
  "url": "https://careers.redfin.com/us/en/search-results?keywords=washington%20software%20engineer",
  "contentHash": "efc66ad5bb2d328a42c07b1126d6d6b1",
  "content": "Showing  12 results for \"washington software engineer\" 12 results foundNo result foundSearch within resultsGo1-10of12resultsSort by:RelevanceRecentjobs sorted by Most relevantFilterSoftware Engineer IIThe Data Ingestion and Infrastructure team builds infrastructure, pipelines, and platforms to help support and modernize large data processing that have made Redfin the most trusted real-estate site i...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 10th 2025Apply NowSoftware Engineer - Digital MarketingAs a Software Engineer - Digital Marketing, you will work on Redfin’s entire digital marketing platform: data pipelines with our partners, campaign management and bid optimization tools, automation of...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  February 2nd 2025Apply NowStaff Software Engineer - Data StreamingAs a Staff Software Engineer on the Data Streaming team you will be responsible for leading our strategy and implementation, while mentoring other engineers on the team. The team is responsible for da...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 26th 2025Apply NowSr Software Engineer - Applied Machine LearningAs a Senior Software Engineer for the Applied Machine Learning Team, your job is to define and own the application architecture that delivers high-volume, high-scale ML products to Redfin’s customers....Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 25th 2025Apply NowSoftware Developer IIYou will develop responsive, resilient, scalable, and high-quality software using React, Java, AWS, and various other tools/libraries. You will collaborate with other engineering and product stakehold...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 31st 2025Apply NowSecurity Operations EngineerYou will monitor Redfin’s security event sources, and respond to alerts or identify and create new correlation rules or runbooks. You will respond to security alerts, researching and contextualizing e...Location : Seattle, Washington, United States of AmericaCategory : Engineering & ProductJob Type : Full timePosted Date :  April 3rd 2025Apply NowSr. Cloud Provisioning EngineerCloud Provisioning Engineer on our compute team, you will help us to architect and build a platform that scales, while ensuring a secure, cost effective and reliable ecosystem. You have 5+ years of ex...Available in 3 locationsAvailable in 3 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  April 10th 2025Apply NowSr. Machine Learning Engineer - Applied Machine LearningYou will help design and implement how our machine learning model development, training and inference platforms are automated and scalable. You have 5+ years of machine learning and software engineeri...Available in 2 locationsAvailable in 2 locationsCategory : Engineering & ProductJob Type : Full timePosted Date :  March 25th 2025Apply NowAndroid Mobile Engineer - Latin America/South America BasedYou continually obsess over improving the user experience, whether it's collaborating with product managers and designers to build beautiful products or finding and squashing performance bottlenecks....Location : Seattle, Washington, United States of AmericaCategory : Engineering & ProductJob Type : Full timePosted Date :  March 20th 2025Apply NowManager, Account Management - Partner ProgramAs a Manager, Partner Program, you will oversee a team of Account Managers who are responsible for managing relationships with our real estate agent partners. Oversee the implementation of CRM and oth...Location : Seattle, Washington, United States of AmericaCategory : Marketing & Business DevelopmentJob Type : Full timePosted Date :  April 10th 2025Apply NowPrev12Next",
  "timestamp": "2025-04-12T23:43:25.028Z",
  "previousTimestamp": "2025-04-10T02:38:13.343Z"
}