{
  "url": "https://corporate.visa.com/en/jobs/?categories=Software%20Development%2FEngineering&categories=Software%20Quality%20Assurance%20and%20Testing&categories=Technology%20and%20Operations&categories=Systems%20%26%20Database%20Admin,%20Analysis,%20Design&categories=Data%20Architect%2FEngineering%2FScience&categories=Data%20Science%2FData%20Engineering&categories=Information%20Technology&functions=Product&functions=Technology&cities=Bellevue&cities=Washington",
  "contentHash": "73c27e9c2722dc8bf24534d4c22ab0eb",
  "content": "16 results  Send email  SHARE LINK  Copy link Sort by: RelevanceNewest to Oldest Staff Software Engineer Location  Bellevue, WA Job #  REF055659W Team  Technology  Senior Director - Software Engineering Location  Bellevue, WA Job #  REF060588W Team  Technology  Staff Software Engineer II  Location  Bellevue, WA Job #  REF057885W Team  Technology  Principal Data Scientist at Authorize.net (Visa) Location  Bellevue, WA Job #  REF056296W Team  Technology  Staff Software Engineer II (I6.5) Location  Bellevue, WA Job #  REF056705W Team  Technology  Software Engineer II Location  Bellevue, WA Job #  REF81228D Team  Technology  Principal Software Engineer (Authorize.net) Location  Bellevue, WA Job #  REF055198W Team  Technology  Lead, Staff Software Engineer Location  Bellevue, WA Job #  REF055112W Team  Technology  Staff Software Engineer Fullstack  Location  Bellevue, WA Job #  REF82818F Team  Technology  Software Engineer, New College Grad - 2025 Location  Bellevue, WA Job #  REF84870M Team  Technology  Sr. Manager, Software Engineering Location  Bellevue, WA Job #  REF056606W Team  Technology  Chief Software Engineer (Hybrid) Location  Bellevue, WA Job #  REF054301W Team  Technology  Senior Software Engineer Location  Bellevue, WA Job #  REF82189R Team  Technology  Sr. SW Engineer Location  Bellevue, WA Job #  REF82267K Team  Technology  Staff Software Engineer (Frontend, React) Location  Bellevue, WA Job #  REF053251W Team  Technology  Software Engineer - Sr. Consultant level Location  Bellevue, WA Job #  REF054035W Team  Technology",
  "timestamp": "2025-04-12T23:43:01.089Z",
  "previousTimestamp": "2025-04-10T02:38:01.292Z"
}