{
  "url": "https://jobs.apple.com/en-us/search?sort=relevance&key=university+new%252520grad+entry%252520level&location=seattle-SEA&team=apps-and-frameworks-SFTWR-AF+cloud-and-infrastructure-SFTWR-CLD+core-operating-systems-SFTWR-COS+devops-and-site-reliability-SFTWR-DSR+engineering-project-management-SFTWR-EPM+information-systems-and-technology-SFTWR-ISTECH+machine-learning-and-ai-SFTWR-MCHLN+security-and-privacy-SFTWR-SEC+software-quality-automation-and-tools-SFTWR-SQAT+wireless-software-SFTWR-WSFT",
  "contentHash": "cb524240785eb6643fbb812b9860ff10",
  "content": "Search Results14  Filter(s) AppliedSearch savedSave SearchTo save this search, sign in with your Apple Account.Sign InDon’t have an Apple Account?Create one nowForgot your Apple Account or password?DeleteKeyword: universityDeleteKeyword: new gradDeleteKeyword: entry levelDeleteSeattle, Washington, United StatesDeleteSoftware and Services: Apps and FrameworksDeleteSoftware and Services: Cloud and InfrastructureDeleteSoftware and Services: Core Operating SystemsDeleteSoftware and Services: DevOps and Site ReliabilityDeleteSoftware and Services: Engineering Project ManagementDeleteSoftware and Services: Information Systems and TechnologyDeleteSoftware and Services: Machine Learning and AIDeleteSoftware and Services: Security and PrivacyDeleteSoftware and Services: Software Quality, Automation, and ToolsDeleteSoftware and Services: Wireless SoftwareMore Filter list4 Result(s) Showing 1 to 4 of 4 results.Sort by: RelevanceSort the search results.RelevanceNewestTeam: AscendingTeam: DescendingLocation Name: AscendingLocation Name: DescendingSort by:RelevanceNewestTeam: AscendingTeam: DescendingLocation Name: AscendingLocation Name: DescendingJob OpportunitiesJob title, team, and date postedLocationActionsCloudKit Client Software EngineerSoftware and ServicesAug 30, 2024SeattleAdd to Favorites CloudKit Client Software EngineerRemoved from favoritesTo view your favorites, sign in with your Apple Account.Sign InDon’t have an Apple Account?Create one nowForgot your Apple Account or password?ShareCloudKit Client Software EngineerSubmit ResumeCloudKit Client Software EngineerShareSubmit ResumeMore, CloudKit Client Software EngineerSee full role descriptionCloudKit Client Software EngineerShareCloudKit Client Software EngineerRole Number: 200565945Weekly Hours: 40 HoursImagine what we could do together. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish. \n\nApple is looking for an experienced Software Engineer to help develop the next generation of cloud services infrastructure. You will be working on key components of the Apple cloud platform and introducing new fundamental capabilities. Your work will help to power entirely new applications and scale existing ones, such as Photos, Messages, FaceTime, Note...Submit ResumeCloudKit Client Software EngineerSenior Software Engineer, Apple Services EngineeringSoftware and ServicesMar 26, 2025SeattleAdd to Favorites Senior Software Engineer, Apple Services EngineeringRemoved from favoritesTo view your favorites, sign in with your Apple Account.Sign InDon’t have an Apple Account?Create one nowForgot your Apple Account or password?ShareSenior Software Engineer, Apple Services EngineeringSubmit ResumeSenior Software Engineer, Apple Services EngineeringShareSubmit ResumeMore, Senior Software Engineer, Apple Services EngineeringSee full role descriptionSenior Software Engineer, Apple Services EngineeringShareSenior Software Engineer, Apple Services EngineeringRole Number: 200596665Weekly Hours: 40 HoursImagine what we could do together. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish.\n\nApple is looking for an experienced Software Engineer to help develop the next generation of cloud services infrastructure. You will be working on key components of iCloud and introducing new fundamental capabilities. Our team is responsible for ensuring the protection of iCloud customer data, and we contribute to groundbreaking products such as Advanced ...Submit ResumeSenior Software Engineer, Apple Services EngineeringSoftware Engineer, Cloud Music Library - Apple Services EngineeringSoftware and ServicesJan 31, 2025SeattleAdd to Favorites Software Engineer, Cloud Music Library - Apple Services EngineeringRemoved from favoritesTo view your favorites, sign in with your Apple Account.Sign InDon’t have an Apple Account?Create one nowForgot your Apple Account or password?ShareSoftware Engineer, Cloud Music Library - Apple Services EngineeringSubmit ResumeSoftware Engineer, Cloud Music Library - Apple Services EngineeringShareSubmit ResumeMore, Software Engineer, Cloud Music Library - Apple Services EngineeringSee full role descriptionSoftware Engineer, Cloud Music Library - Apple Services EngineeringShareSoftware Engineer, Cloud Music Library - Apple Services EngineeringRole Number: 200588987Weekly Hours: 40 HoursMusic is a universal language that brings people together. That's what we truly believe at Apple and that's why we built Apple Music, a streaming service that has revolutionized the way we experience music. With Apple Music, you can access millions of songs, curated playlists, and exclusive content, all from the palm of your hand.\n\nOur team--Cloud Music Library--is dedicated to providing the best possible personalized music experience for our users on all their devices. We power core Apple Music features such as the cloud-synced Music Library, SharePlay, Collaborative Playlists, and Radio. ...Submit ResumeSoftware Engineer, Cloud Music Library - Apple Services EngineeringAIML - Senior Software Engineer, Siri and Information IntelligenceSoftware and ServicesMay 30, 2024SeattleAdd to Favorites AIML - Senior Software Engineer, Siri and Information IntelligenceRemoved from favoritesTo view your favorites, sign in with your Apple Account.Sign InDon’t have an Apple Account?Create one nowForgot your Apple Account or password?ShareAIML - Senior Software Engineer, Siri and Information IntelligenceSubmit ResumeAIML - Senior Software Engineer, Siri and Information IntelligenceShareSubmit ResumeMore, AIML - Senior Software Engineer, Siri and Information IntelligenceSee full role descriptionAIML - Senior Software Engineer, Siri and Information IntelligenceShareAIML - Senior Software Engineer, Siri and Information IntelligenceRole Number: 200548043Weekly Hours: 40 HoursImagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Do you want to make Siri and Apple products smarter for our users? \n\nThe Information Intelligence teams are building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search ...Submit ResumeAIML - Senior Software Engineer, Siri and Information IntelligencePrevious PagePage NumberOf1Next Page",
  "timestamp": "2025-03-26T22:04:25.105Z",
  "previousTimestamp": "2025-03-26T21:15:41.954Z"
}