{
  "url": "https://jobs.apple.com/en-us/search?sort=relevance&key=university+new%252520grad+entry%252520level&location=seattle-SEA&team=apps-and-frameworks-SFTWR-AF+cloud-and-infrastructure-SFTWR-CLD+core-operating-systems-SFTWR-COS+devops-and-site-reliability-SFTWR-DSR+engineering-project-management-SFTWR-EPM+information-systems-and-technology-SFTWR-ISTECH+machine-learning-and-ai-SFTWR-MCHLN+security-and-privacy-SFTWR-SEC+software-quality-automation-and-tools-SFTWR-SQAT+wireless-software-SFTWR-WSFT",
  "contentHash": "e345d198fdaa9d8728f4c5dfd28cef01",
  "content": "14 Filter(s) AppliedSave SearchSeattle, Washington, United StatesKeyword: universityKeyword: new%2520gradKeyword: entry%2520levelSoftware and Services: Apps and FrameworksSoftware and Services: Cloud and InfrastructureSoftware and Services: Core Operating SystemsSoftware and Services: DevOps and Site ReliabilitySoftware and Services: Engineering Project ManagementSoftware and Services: Information Systems and TechnologySoftware and Services: Machine Learning and AISoftware and Services: Security and PrivacySoftware and Services: Software Quality, Automation, and ToolsSoftware and Services: Wireless SoftwareMoreThe page has been updated. 4 results were found.Search Results4 Result(s)Sort by: RelevanceCloudKit Client Software EngineerSoftware and ServicesAug 30, 2024SeattleAdd to Favorites CloudKit Client Software EngineerRemoved from favoritesSee full role descriptionShareRole Number:  200565945Weekly Hours: 40 HoursImagine what we could do together. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish. \n\nApple is looking for an experienced Software Engineer to help develop the next generation of cloud services infrastructure. You will be working on key components of the Apple cloud platform and introducing new fundamental capabilities. Your work will help to power entirely new applications and scale existing ones, such as Photos, Messages, FaceTime, Note...Submit Resume Senior Software Engineer, Apple Services EngineeringSoftware and ServicesMar 26, 2025SeattleAdd to Favorites Senior Software Engineer, Apple Services EngineeringRemoved from favoritesSee full role descriptionShareRole Number:  200596665Weekly Hours: 40 HoursImagine what we could do together. At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish.\n\nApple is looking for an experienced Software Engineer to help develop the next generation of cloud services infrastructure. You will be working on key components of iCloud and introducing new fundamental capabilities. Our team is responsible for ensuring the protection of iCloud customer data, and we contribute to groundbreaking products such as Advanced ...Submit Resume Software Engineer, Cloud Music Library - Apple Services EngineeringSoftware and ServicesJan 31, 2025SeattleAdd to Favorites Software Engineer, Cloud Music Library - Apple Services EngineeringRemoved from favoritesSee full role descriptionShareRole Number:  200588987Weekly Hours: 40 HoursMusic is a universal language that brings people together. That's what we truly believe at Apple and that's why we built Apple Music, a streaming service that has revolutionized the way we experience music. With Apple Music, you can access millions of songs, curated playlists, and exclusive content, all from the palm of your hand.\n\nOur team--Cloud Music Library--is dedicated to providing the best possible personalized music experience for our users on all their devices. We power core Apple Music features such as the cloud-synced Music Library, SharePlay, Collaborative Playlists, and Radio. ...Submit Resume AIML - Senior Software Engineer, Siri and Information IntelligenceSoftware and ServicesMay 30, 2024SeattleAdd to Favorites AIML - Senior Software Engineer, Siri and Information IntelligenceRemoved from favoritesSee full role descriptionShareRole Number:  200548043Weekly Hours: 40 HoursImagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there’s no telling what you could accomplish. Do you want to make Siri and Apple products smarter for our users? \n\nThe Information Intelligence teams are building groundbreaking technology for algorithmic search, machine learning, natural language processing, and artificial intelligence. The features we build are redefining how hundreds of millions of people use their computers and mobile devices to search ...Submit Resume Previous PagePage NumberPage 1Of1Next Page",
  "timestamp": "2025-03-31T21:12:50.605Z",
  "previousTimestamp": "2025-03-26T22:04:25.105Z"
}