{
  "url": "https://www.morganstanley.com/careers/career-opportunities-search?opportunity=sg#",
  "contentHash": "43126a336e08a9d29953aaec27e70e46",
  "content": "76 Results Found\nSort by Application Deadline \n\n \n    \n        Filter By\n        Clear All\n    \n    \n        \n            Location\n            \n        \n        Where do you want to work?\n         \n            \n                \n                Clear SelectionsAmericasEurope, Middle East, AfricaJapanNon-Japan Asia\n                        \n                            \n                                \n                                    Select a location...\n                                    All Locations\n                                ArgentinaBrazilCanadaChileColombiaCosta RicaEcuadorGuatemalaMexicoPanamaPeruTrinidad and TobagoUnited States of AmericaUruguay\n                            \n                            \n                                \n                                    All States/Provinces\n                                \n                            \n                            \n                                \n                                    All Cities\n                                \n                            \n                        \n                    Add Another Location\n                    \n                \n            \n        \n    \n    \n        \n            Business Area\n            \n            \n        \n        Which Business Areas and/or Divisions are you interested in ?\n     \n        \n            Clear Selections\n                \n                    \n                        \n                             \n                                \n                                 Institutional Securities Group\n                            \n                            \n                                \n                                      Investment Banking\n                                                                    \n                                \n                                      Global Capital Markets\n                                \n                                \n                                      Sales and Trading\n                                \n                                \n                                      Research\n                                \n\n                                \n                                      Quantitative Finance\n                                \n                                \n                                      Global Sustainable Finance\n                                \n                            \n                        \n                    \n                \n\n                \n\t\t\t\t\t\t\n                            \n                                  Investment Management\n                            \n                            \n                                  Operations\n                            \n                            \n                                  Technology\n                            \n\t\t\t\t\t\t\t\n                             \n                                \n                                 Wealth Management\n                            \n                            \n                                \n                                      Wealth Management\n                                 \n                                \n                                      Morgan Stanley Bank\n                                  \n                    \t\t\n\n                    \n                \n\n                \n                    \n                        \n                              Company \n                            \n                            \n                                \n                                      Corporate Services\n                                \n                                \n                                      Corporate Affairs\n                                \n                                \n                                      Company Management\n                                \n                                \n                                      Legal and Compliance\n\t\t\t\t\t\t\t\t\n\n                                \n                                      Finance\n                                \n                                \n                                          Firm Risk Management\n\t\t\t\t\t\t\t\t\t\n                                \n                                \n                                      Human Resources\n                                \n                                \n                                      Internal Audit\n                                \n                            \n                        \n                    \n                \n\n            \n        \n    \n\n    \n        \n            Education Level\n            \n            \n        \n        \n        What is your education level?\n        \n            \n                    Clear Selections\n                    \n                            \n                                 \n                                        Associate's Degree/College Diploma\n                            \n                            \n                                 \n                                                Bachelor's Degree\n                            \n                            \n                                 \n                                                Doctorate Degree\n                            \n                            \n                                 \n                                                High School Diploma/GED\n                            \n                            \n                                 \n                                        Master's Degree\n                            \n                            \n                                 \n                                        Masters of Business Administration\n                            \n                            \n                                 \n                                        None\n                            \n                                               \n            \n\n        \n    \n\n    \n        \n            Program Type\n            \n            \n     \n     Which type of program you are looking for?\n            \n                \n                        Clear Selections                                        \n                    \n                        \n                             \n                                    Apprenticeship\n                        \n                        \n                             \n                                    Diversity Event/Program\n                        \n                        \n                             \n                                    Full-Time\n                        \n                        \n                             \n                                    High School Internship\n                        \n                        \n                             \n                                    Internship\n                        \n                     \n\n            \n        \n    \n\n    \n            \n                Jobs available in: English\n                \n            \n                \n                                           \n                            \n                                \n                                     \n                                            English\n                                \n                                \n                                     \n                                            Francais\n                                \n                            \n                        \n            \n            \n    START NEW SEARCHdone\n\n     Next \n     Done \n    All Students & Graduates Opportunities\n    \n\n\nSTUDENTS & GRADUATES2026 Investment Management Sophomore Summer Analyst Program - Private Credit (New York)Investment ManagementNew York, United States of America Job # 19073Apply Now(opens in a new tab)                                             Application Deadline: Mar 28, 2025Program Type: InternshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has more than 1,400 investment professionals around the world and 1.7 trillion in assets under management or supervision as of December 31st, 2024. Morgan Stanley Investment Management strives to provide strong long-term investment performance, outstanding service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations, and individuals worldwide. General Description The Investment Management Summer Analyst Program is a 10-week program starting in June. The program consists of one week of training and nine weeks working within a specific IM team. Across all IM teams, the curriculum is designed to equip Summer Analysts with the fundamental skills they need to be successful in IM. During the 10-week program, Summer Analysts experience the culture and atmosphere of Morgan Stanley by performing a role similar to a Full-Time Analyst. Summer Analysts will be placed into a specific strategy team for their summer program, including Opportunistic Investing, Buyout Private Equity, Private Credit, Transformational Secondaries, and Venture. This role within MSIM is primarily a learning and growth opportunity, which does not necessarily correlate with full-time opportunities within the firm. Primary Responsibilities Work with senior members of the Fund to conduct diligence on investment opportunities Coordinate with advisors and consultants on due diligence items Help construct company financial forecast and valuation models Execute other investment related tasks (track prospective deals, help negotiate confidentiality agreements, etc.) Contribute to investment memoranda on investment opportunities Monitor performance of existing portfolio companies Keep current with market developments, such as new investment products and movements in the economy Develop your public speaking, company/industry research and analysis (qualitative), modeling, presentation building, and project management skills Job Requirements Pursuing a Bachelor's degree and will graduate between December 2027 and June 2028 Exceptional academic performance and communication skills, both verbal and written Strong team player; ability to collaborate with colleagues across the team and within the broader organization Self-starter with the ability to work independently Driven, highly motivated and results-focused Strong organizational and time management skills, with ability to manage projects and competing priorities Problem solver, with an analytical and detail-oriented mindset Keen interest in investing Application Process and Deadline In order to be considered, candidates must apply with their resume through the Morgan Stanley website and complete their HireVue digital questionnaire. Resumes will be reviewed on a rolling basis until the role is filled or the application deadline, whichever comes first. Applications must be submitted by Friday, March 28, 2025 at 11:55 PM EST and HireVues completed by Sunday, March 30, 2025 at 11:55 PM EST in order to be considered. Expected base pay rates for the role will be 36.06 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Investment Management Sophomore Summer Analyst Program - Secondaries (New York)Investment ManagementNew York, United States of America Job # 19074Apply Now(opens in a new tab)                                             Application Deadline: Mar 28, 2025Program Type: InternshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has more than 1,400 investment professionals around the world and 1.7 trillion in assets under management or supervision as of December 31st, 2024. Morgan Stanley Investment Management strives to provide strong long-term investment performance, outstanding service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations, and individuals worldwide. General Description The Investment Management Summer Analyst Program is a 10-week program starting in June. The program consists of one week of training and nine weeks working within a specific IM team. Across all IM teams, the curriculum is designed to equip Summer Analysts with the fundamental skills they need to be successful in IM. During the 10-week program, Summer Analysts experience the culture and atmosphere of Morgan Stanley by performing a role similar to a Full-Time Analyst. Morgan Stanley Private Equity Secondaries, an investment team within Morgan Stanley Investment Management, seeks to deliver innovative private market solutions to a global client base. As part of Morgan Stanley Private Credit & Equity (PC&E), a broader division of dedicated private markets focused professionals, the secondaries business draws on decades of investment experience across private markets. With a focus on GP-Led secondaries transactions in developed buyout and growth markets, the Team structures compelling opportunities within less efficient markets and has deployed over 4.6 billion to 54 GP-Led Continuation Vehicle transactions across North America and Europe, as of September 30, 2024. The Teams investment strategy focuses on GP-led private equity secondary transactions, primarily in situations that entail a restructuring or recapitalization of a single asset managed by a high quality lower middle market private equity sponsor. The Teams approach to each investment is bespoke, tailored to provide an optimal solution to each of the stakeholders in a transaction, which requires transaction expertise, thorough due diligence, and careful crafting to achieve the desired objectives for all parties involved. In addition to providing liquidity to existing limited partners, the key driving factors for these transactions typically include a variety of goals such as restoring alignment between the manager and investors, providing the manager with more time to create value, and financing tactical growth capital. In each situation, the Team approaches the transaction with the aim of providing a capital-based solution to the structural issue being addressed, with a core focus on ensuring strong alignment with a high caliber private equity sponsor and the Funds investors. Please refer to www.morganstanley.com/ideas for additional insights on the private equity secondaries market. This role within MSIM is primarily a learning and growth opportunity, which does not necessarily correlate with full-time opportunities within the firm. Primary Responsibilities: Construct, analyze, and modify detailed financial and LBO models and returns analyses Conduct market and company analysis on both quantitative and qualitative basis Participate in investment diligence meetings Prepare and present investment memos to the Investment Committee Support investment sourcing, client service requests, portfolio monitoring, and other organizational processes Job Requirements: Pursuing a Bachelor's degree and will graduate between December 2027 and June 2028 An understanding of financial concepts, valuation, and accounting Strong quantitative and qualitative analytical skills Strong verbal and written communication skills High level of attention-to-detail and strong work ethic Application Process and Deadline In order to be considered, candidates must apply with their resume through the Morgan Stanley website and complete their HireVue digital questionnaire. Resumes will be reviewed on a rolling basis until the role is filled or the application deadline, whichever comes first. Applications must be submitted by Friday, March 28, 2025 at 11:55 PM EST and HireVues completed by Sunday, March 30, 2025 at 11:55 PM EST in order to be considered. Expected base pay rates for the role will be 36.06 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES Equity Research (LATAM) - Analyst- Consumer (São Paulo, Brazil)Institutional Securities GroupSao Paulo, Brazil Job # 19255Apply Now(opens in a new tab)                                             Application Deadline: Mar 31, 2025Program Type: Full TimeProgram Description Equity Research The Equity Research department is responsible for researching macroeconomic and microeconomic conditions, along with company fundamentals. It also collects and analyses financial information to make investment recommendations on stocks in specific sectors. Research analysts build financial models to explore alternative scenarios, examine industries and communicate with companies and investors. Equity Research team members discuss their analysis and investment recommendations in research notes. A career in investment research at Morgan Stanley demands a commitment to excellence and a passion for the markets as well as the highest level of integrity. We are seeking an Analyst-level individual to join our Research team in Sao Paulo, Brazil. Experience with Equity Research Assist in writing research reports for initiations of stock coverage, analysis of data, earnings results, industry news, and thematic topics Create and maintain earnings, valuation and industry models leveraging skills in accounting, finance and economics Leverage all available resources to create differentiated content for research reports (company-specific or industry) Interact with institutional investors to discuss companies under coverage, investment theses, and respond to requests Keep abreast of industry-related news/industry developments flow and analyze implications for companies under coverage Develop and maintain relationships with investor relations personnel and management of companies under coverage Conduct industry diligence and primary research through surveys, expert conference calls, and various channel checks to evaluate industry trends Assist internal sales and trading teams in the timely analysis of breaking news in the sector Qualifications Experience utilizing Excel to Build / Maintain Financial models, an advanced level of excel proficiency is expected and required. Experience writing in a professional capacity, e.g. correspondence; presentation and/or development of industry reports High proficiency in spoken and written English language. Strong PowerPoint skills are required Expected to be adaptable and have the ability to work well under pressure Strong attention to detail is a must CFA is a plusLearn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Banking Off-cycle Internship (London)Institutional Securities GroupLondon, United Kingdom Job # 17565Apply Now(opens in a new tab)                                             Application Deadline: Mar 31, 2025Program Type: InternshipProgram Description PLACEMENT AND DURATION The Investment Banking Off-cycle Internship is an opportunity to experience the culture and atmosphere in the Investment Banking Division (IBD) by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. The internship typically lasts six months but can vary in length depending on business needs and candidate availability. You will spend your internship assigned to a specific group in a specific region, building basic skills in financial analysis, accounting, and valuation, while working on a wide range of domestic and international transactions. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Gathering and synthesising financial and operating information about companies, industries, and governments. Creating and updating financial models. Gathering market data to analyse trends and help value and price transactions. Drafting presentations and memoranda for a wider audience within the Firm and the financial services industry. Attending team discussions and client meetings, where you may be asked to deliver parts of a presentation. QUALIFICATIONS/SKILLS/REQUIREMENTS You have strong analytical and numerical skills that put you at ease with financial data. You are results-driven, and perform well under pressure and against tight deadlines. You are a proven team player and can manage a wide range of responsibilities. You have an excellent academic background and fluency in English and Spanish preferred. Ability to communicate effectively in multiple languages is an advantage. You articulate complex ideas simply and summarise them effectively. You are committed to excellence in your work and maintain high professional and ethical standards. APPLICATION DEADLINE We recruit on a rolling basis so application is encouraged as soon as possible. We aim to review all applications within a timely manner, however our response times may vary due to high volumes. Please be assured that you will receive an update via email as soon as a decision on your application has been reached, and kindly note we are unable to accommodate any requests to accelerate the timelines of our application process.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Investment Management Sophomore Summer Analyst Program - Next Level Fund (New York)Investment ManagementNew York, United States of America Job # 19072Apply Now(opens in a new tab)                                             Application Deadline: Apr 04, 2025Program Type: InternshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has more than 1,400 investment professionals around the world and 1.7 trillion in assets under management or supervision as of December 31st, 2024. Morgan Stanley Investment Management strives to provide strong long-term investment performance, outstanding service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations, and individuals worldwide. General Description The Investment Management Summer Analyst Program is a 10-week program starting in June. The program consists of one week of training and nine weeks working within a specific IM team. Across all IM teams, the curriculum is designed to equip Summer Analysts with the fundamental skills they need to be successful in IM. During the 10-week program, Summer Analysts experience the culture and atmosphere of Morgan Stanley by performing a role similar to a Full-Time Analyst. This role within MSIM is primarily a learning and growth opportunity, which does not necessarily correlate with full-time opportunities within the firm. Next Level Fund: The Next Level Fund is an early-stage venture fund investing in Series Seed to Series C technology and technology-enabled companies with a diverse or female founder. The fund Invests across industries including information technology, telecommunications and media, consumer, financial services, cybersecurity, proptech, healthcare, and business services. Primary Responsibilities: Work with senior members of the Fund to conduct diligence on investment opportunities Help construct company financial forecast and valuation models Execute other investment related tasks (track prospective deals, screen pitches and product demos, etc.) Contribute to investment memoranda on investment opportunities Monitor performance of existing portfolio companies Keep current with market developments, such as new investment products and movements in the economy Develop your public speaking, company/industry research and analysis (qualitative), modeling, presentation building, and project management skills Job Requirements: Pursuing a Bachelor's degree and will graduate between December 2027 and May 2028 Exceptional academic performance and communication skills, both verbal and written Strong team player; ability to collaborate with colleagues across the team and within the broader organization Self-starter with the ability to work independently Driven, highly motivated and results-focused Strong organizational and time management skills, with ability to manage projects and competing priorities Problem solver, with an analytical and detail-oriented mindset Keen interest in investing Application Process and Deadline In order to be considered, candidates must apply with their resume through the Morgan Stanley website and complete their HireVue digital questionnaire. Resumes will be reviewed on a rolling basis until the role is filled or the application deadline, whichever comes first. Applications must be submitted by Friday, April 4, 2025 at 11:55 PM EST and HireVues completed by Sunday, April 6, 2025 at 11:55 PM EST in order to be considered. Expected base pay rates for the role will be 36.06 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Global Capital Markets Industrial Placement Program (Sydney)Institutional Securities GroupSydney, Australia Job # 18449Apply Now(opens in a new tab)                                             Application Deadline: Apr 06, 2025Program Type: InternshipProgram Description 2025 Global Capital Markets Industrial Placement Program (Sydney) Job Description When clients need capital, Global Capital Markets (GCM) responds with market judgments and ingenuity. Whether executing an IPO, a debt offering or a leveraged buyout, GCM integrates Morgan Stanleys expertise in Sales and Trading and Investment Banking, offering clients seamless advice and sophisticated solutions. GCM originates, structures and executes public and private placement of equities, investment-grade and noninvestment-grade debt and related products. The group provides fresh ideas and broad distribution to help clients get the most out of each stage of a transaction, and continually develops capital markets solutions to enable clients to mitigate strategic, operational, credit and market risks. Our Industrial Placement Program is aimed at undergraduates who are either required by their degree or are able to complete a longer internship period. The six-month internship (June/July 2025 start depending on business needs and candidate availability) is designed to provide a realistic view of Global Capital Markets by having the interns assume the functions of Full-Time Analysts. Along the way, you will obtain a strong foundation in the basic skills of financial analysis and deal execution. You will be expected to start learning how to market the Firms products and services effectively. Training Program This intensive six-month program includes an orientation to Morgan Stanleys businesses and technical training. Your training will continue throughout the internship with structured learning sessions run by senior executives. Similarly, you will have many opportunities to integrate with peers and senior staff through a series of networking, social, charity and mentoring events. Role and Responsibilities The work is challenging, and Industrial Placement Interns are encouraged to roll up their sleeves, dig into financial statements and construct innovative solutions. You will spend the internship in Equity Capital Markets or Fixed Income Capital Markets, building a foundation of financial skills and a solid understanding of the markets. You will have a mentor and buddy aid in your development and to provide greater exposure to GCM and the Firm. You will be encouraged to take on responsibility quickly and help bridge various topics from new trends in the marketplace to group overviews. Qualifications and Skills You are pursuing an undergraduate Bachelors or Master's degree with a graduation date between June 2026 and February 2027. You have an ability to manage multiple projects, provide complicated financial analysis, and develop appropriate corporate finance solutions. Extraordinarily high level of motivation and attention to detail Strong written and verbal communication skills Commercial instinct and ability to perform under pressure and tight deadlines Interest in developing a career in Global Capital Markets Application Process and Deadline Application processes may vary by location but typically follows: CV Online Video Interview Interviews In order to be considered, candidates must apply by April 6, 2025 at 23:55 AEST.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025/2026 Morgan Stanley Women in Banking Scholarship Program (Sydney/Melbourne)Multiple Business AreasSydney, Australia Job # 18834Apply Now(opens in a new tab)                                             Application Deadline: Apr 06, 2025Program Type: Diversity Event/ProgramProgram Description At Morgan Stanley, we value the diverse perspectives and backgrounds of our people and our culture of inclusion as one of our defining strengths. The Women in Banking Scholarship Program aims to encourage, promote and support female students who are interested in pursuing a career in the banking industry. The Program will offer: Mentorship opportunities with senior leaders from Morgan Stanley An opportunity to explore Australia Summer Analyst/Industrial Placement positions at Morgan Stanley A monetary award of Gross AUD6,250 upon successful completion of the interview process and commencement of an internship with Morgan Stanley Australia Who Should Apply? Morgan Stanley is seeking confident women who thrive in a dynamic and intellectually stimulating environment. You will possess effective communication and interpersonal skills, the ability to form effective relationships through collaboration, strive for excellence and exhibit the highest ethical standards. You will have the opportunity to learn about the roles and functions which make up our organization to understand where you may fit best These include Investment Banking, Global Capital Markets, Real Estate and Wealth Management. Eligibility Applicants must be in their penultimate year of study, completing their studies by the end of 2026. Applicants must have the right to remain in Australia to work and study. Applications To apply for the Morgan Stanley Women in Banking Scholarship, please submit your resume, cover letter and academic transcript in a PDF format. Following this, successful candidates will be invited to submit a virtual essay, exploring personal motivations and long term goals. Applications will be reviewed on a rolling basis, so we recommend you submit your application early Applications close at 23:55pm AEST on Sunday, 6th April 2025 For questions, please e-mail asia.recruit@morganstanley.com.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Client Engagement Assistant Apprenticeship Programme (London)Institutional Securities GroupLondon, United Kingdom Job # 17720Apply Now(opens in a new tab)                                             Application Deadline: Apr 06, 2025Program Type: ApprenticeshipProgram Description Duration: 18 months Qualification: Level 3 Digital Business Accelerator Join us as an Apprentice at Morgan Stanley and work alongside industry experts gaining valuable on the job training, whilst working towards your qualification. Our Apprenticeship is all about giving you the foundations to kick start your career in a supportive environment, where you can make valuable contributions from the outset and develop both personally & professionally This role sits within the Equity Research Division. The function of the department is to produce market leading in-depth analysis of companies, industries, markets, and world economies. As a client engagement assistant apprentice you will work to assist our research teams in marketing their research content to our vast client base. You will be responsible for coordinating trips worldwide for our analysts to see their clients and directly contribute towards Morgan Stanleys Core Value of Putting Clients First. We're looking for a curious and driven Apprentice who is passionate about building relationships with a variety of different stakeholders whilst having firm control over the day-to-day admin tasks of the research teams. What to Expect: Working collaboratively to assist the teams who create our research Drafting and maintaining an accurate up to date marketing plan Managing and arranging marketing schedules liaising directly with clients Liaising with sales on the coordination and execution of marketing schedules Maintaining distribution lists to ensure content is distributed broadly Supporting our offshore team on admin tasks such as expenses, printing and calendar entries Attend weekly team meetings and provide client updates/information Understand the client base and use tools to improve client engagement Execute group events & conferences Maintaining an up to date workflow and other team documentation Collaborating to ensure diary management and travel accuracy Supporting the team on all new client initiatives Skills Needed: Highly motivated with a can-do attitude Curious with a passion to learn Excellent written & verbal communication skills Team player Ability/desire to develop knowledge of Microsoft Office applications including exceptional Excel skills Highly motivated, and proactive. Able to stay one step ahead and think outside the box Resourceful, reliable, displays good time-management, and enjoys taking the initiative to deliver results Ability to build and sustain enduring professional relationships with individuals across all levels whilst maintaining confidentiality You Must Have: Have achieved GCSE English & Maths 4-9 (C-A) or equivalent Have achieved or be on track to achieve three A levels or equivalent, grade C or aboveLearn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Management Off-cycle Internship - Real Estate Investing (Milan)Investment ManagementMilan, Italy Job # 17638Apply Now(opens in a new tab)                                             Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT & DURATION Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. Morgan Stanley Real Estate Investing (REI) is Morgan Stanley's integrated global real estate practice. We are the world's leading global real estate investment manager with over 53 billion in real estate assets under management across core, value-added and opportunistic investment vehicles. REI acquires properties, operating companies, and real estate backed departments on a global scale on behalf of our institutional investors. The internship will commence in January 2025 and typically lasts six months. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Collecting and synthesizing financial and operating information about potential investment opportunities and industries. Creating financial models. Gathering market data to analyse trends and help value and price transactions. Drafting presentations and memoranda for a wider audience within the Firm. Attending team discussions and partner meetings, where you may be asked to deliver parts of a presentation. QUALIFICATIONS/ SKILLS/ REQUIREMENTS Ability to analyse and interpret complex information quickly and accurately. Strong aptitude for numbers. Ability to communicate complex ideas clearly and succinctly. Temperament that thrives under pressure and changing situations. Strong analytical and numerical skills that put you at ease with financial data Results-driven and able to perform well under pressure and against tight deadlines. Proven team player with the ability to manage a wide range of responsibilities. Committed to excellence in your work and maintain high professional and ethical standards. Fluency in English and in the local language based on the location you are applying for You have graduated from university or able to take the time off to commit for a full time internship role for six months if you are currently in studyLearn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Management Off-cycle Internship - Real Estate Investing (Madrid)Investment ManagementMadrid, Spain Job # 17627Apply Now                                             (opens in a new tab)Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT & DURATION Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. Morgan Stanley Real Estate Investing (REI) is Morgan Stanley's integrated global real estate practice. We are the world's leading global real estate investment manager with over 53 billion in real estate assets under management across core, value-added and opportunistic investment vehicles. REI acquires properties, operating companies, and real estate backed departments on a global scale on behalf of our institutional investors. The Off-Cycle Internship is an opportunity to experience the culture and atmosphere in the Investment Management Division by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. This internship will offer you an exciting and a dynamic work environment where you get to work alongside our diverse group of experienced professionals. The work that you do will be interesting and varied. The internship will commence by Q2 2025 and typically lasts six months but can vary in length depending on business needs and candidate availability.. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Collecting and synthesizing financial and operating information about potential investment opportunities and industries Creating financial models Gathering market data to analyse trends and help value and price transactions Drafting presentations and memoranda for a wider audience within the Firm Attending team discussions and partner meetings, where you may be asked to deliver parts of a presentation QUALIFICATIONS/ SKILLS/ REQUIREMENTS You have graduated from university or able to take the time off to commit for a full time internship role for six months if you are currently in study Fluency in English and in the local language based on the location you are applying for Ability to analyse and interpret complex information quickly and accurately Strong aptitude for numbers Ability to communicate complex ideas clearly and succinctly Temperament that thrives under pressure and changing situations Strong analytical and numerical skills that put you at ease with financial data Results-driven and able to perform well under pressure and against tight deadlines Proven team player with the ability to manage a wide range of responsibilities. Committed to excellence in your work and maintain high professional and ethical standardsLearn More                                             (opens in a new tab) 123...8\n\n\n \n\tThere are currently no opportunities open.Please choose other filters to see different results.\n\tCLEAR ALL FILTERS TO SEE MORE OPPORTUNITIES\n\tRelated Opportunities",
  "timestamp": "2025-03-29T06:30:00.644Z",
  "previousTimestamp": "2025-03-27T18:47:38.983Z"
}