{
  "url": "https://www.morganstanley.com/careers/career-opportunities-search?opportunity=sg#",
  "contentHash": "db12329e4a71478551beb3f605809e35",
  "content": "79 Results Found\nSort by Application Deadline \n\n \n    \n        Filter By\n        Clear All\n    \n    \n        \n            Location\n            \n        \n        Where do you want to work?\n         \n            \n                \n                Clear SelectionsAmericasEurope, Middle East, AfricaJapanNon-Japan Asia\n                        \n                            \n                                \n                                    Select a location...\n                                    All Locations\n                                ArgentinaBrazilCanadaChileColombiaCosta RicaEcuadorGuatemalaMexicoPanamaPeruTrinidad and TobagoUnited States of AmericaUruguay\n                            \n                            \n                                \n                                    All States/Provinces\n                                \n                            \n                            \n                                \n                                    All Cities\n                                \n                            \n                        \n                    Add Another Location\n                    \n                \n            \n        \n    \n    \n        \n            Business Area\n            \n            \n        \n        Which Business Areas and/or Divisions are you interested in ?\n     \n        \n            Clear Selections\n                \n                    \n                        \n                             \n                                \n                                 Institutional Securities Group\n                            \n                            \n                                \n                                      Investment Banking\n                                                                    \n                                \n                                      Global Capital Markets\n                                \n                                \n                                      Sales and Trading\n                                \n                                \n                                      Research\n                                \n\n                                \n                                      Quantitative Finance\n                                \n                                \n                                      Global Sustainable Finance\n                                \n                            \n                        \n                    \n                \n\n                \n\t\t\t\t\t\t\n                            \n                                  Investment Management\n                            \n                            \n                                  Operations\n                            \n                            \n                                  Technology\n                            \n\t\t\t\t\t\t\t\n                             \n                                \n                                 Wealth Management\n                            \n                            \n                                \n                                      Wealth Management\n                                 \n                                \n                                      Morgan Stanley Bank\n                                  \n                    \t\t\n\n                    \n                \n\n                \n                    \n                        \n                              Company \n                            \n                            \n                                \n                                      Corporate Services\n                                \n                                \n                                      Corporate Affairs\n                                \n                                \n                                      Company Management\n                                \n                                \n                                      Legal and Compliance\n\t\t\t\t\t\t\t\t\n\n                                \n                                      Finance\n                                \n                                \n                                          Firm Risk Management\n\t\t\t\t\t\t\t\t\t\n                                \n                                \n                                      Human Resources\n                                \n                                \n                                      Internal Audit\n                                \n                            \n                        \n                    \n                \n\n            \n        \n    \n\n    \n        \n            Education Level\n            \n            \n        \n        \n        What is your education level?\n        \n            \n                    Clear Selections\n                    \n                            \n                                 \n                                        Associate's Degree/College Diploma\n                            \n                            \n                                 \n                                                Bachelor's Degree\n                            \n                            \n                                 \n                                                Doctorate Degree\n                            \n                            \n                                 \n                                                High School Diploma/GED\n                            \n                            \n                                 \n                                        Master's Degree\n                            \n                            \n                                 \n                                        Masters of Business Administration\n                            \n                            \n                                 \n                                        None\n                            \n                                               \n            \n\n        \n    \n\n    \n        \n            Program Type\n            \n            \n     \n     Which type of program you are looking for?\n            \n                \n                        Clear Selections                                        \n                    \n                        \n                             \n                                    Apprenticeship\n                        \n                        \n                             \n                                    Diversity Event/Program\n                        \n                        \n                             \n                                    Full-Time\n                        \n                        \n                             \n                                    High School Internship\n                        \n                        \n                             \n                                    Internship\n                        \n                     \n\n            \n        \n    \n\n    \n            \n                Jobs available in: English\n                \n            \n                \n                                           \n                            \n                                \n                                     \n                                            English\n                                \n                                \n                                     \n                                            Francais\n                                \n                            \n                        \n            \n            \n    START NEW SEARCHdone\n\n     Next \n     Done \n    All Students & Graduates Opportunities\n    \n\n\nSTUDENTS & GRADUATES2025 Investment Management Fall Co-Op Program - Fixed Income Emerging Markets Corporate Debt (Boston)Investment ManagementBoston, United States of America Job # 19319Apply Now(opens in a new tab)                                             Application Deadline: Mar 28, 2025Program Type: InternshipProgram Description Program Overview Morgan Stanley Investment Management (MSIM) hires undergraduate co-ops to simultaneously contribute to and learn about various groups within our division. Co-ops spend six months fully immersed in their work and MSIM culture, resulting in an enriching and formative experience. The co-op role within MSIM is primarily a learning and growth opportunity, which does not necessarily correlate with full-time opportunities within the firm. Team Overview The Emerging Markets Debt team manages approximately 20 billion across a range of investment strategies. The team conducts fundamental credit research for companies domiciled in emerging and frontier countries outside the US and translates these fundamental views into investment ideas. Our research process weaves value-driven bottoms-up analysis with top-down macro views from our sovereign colleagues. We seek both long and short investments by using a variety of debt and equity instruments to execute our strategies. Our team is made up of highly motivated professionals with diverse backgrounds who complement our global perspective. The co-op will commence in Spring 2025 and last six months. This co-op offers you the opportunity to do in-depth investment research, contribute to the portfolio construction process, and participate in meetings with various stakeholders in the financial industry. Co-ops are treated as full-time members of the team and work alongside experienced professionals at all levels. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Conduct in-depth investment research on companies using financial statements, industry reports, and various news sources. Build financial models for companies across various industries. Monitor news sources for specific companies, industries, and countries. Partake in research and due diligence conference calls and meetings. Prepare detailed investment research reports and present findings to investment team. Be available for travel around Boston area for research purposes as required by business needs. QUALIFICATIONS/ SKILLS/ REQUIREMENTS Demonstrated interests in investing, financial markets, economics, and international affairs. You have a positive attitude, strong work ethic and attention to detail in digging deeper on business topics relevant to the team's investment process. You can take the time off to commit for a full-time internship role for six months. Excellent record of academic achievement, with transcript as a proof You have a keen interest in emerging and frontier markets. You are adaptive, can function independently yet are a team player, can prioritize various tasks. Excellent organizational, interpersonal, and time management skills. Ability to function reliably, independently, and with a high degree of accuracy and attention to detail. You have strong analytical and numerical skills. You have strong MS Office skills. Application Process and Deadline In order to be considered, candidates must apply with their resume and transcript through the Morgan Stanley website. Resumes will be reviewed on a rolling basis starting March 17th, 2025 and continuing through March 31st, 2025, or until the role is filled, whichever comes first. Expected base pay rates for the role will be between 30.00 and 40.00 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Investment Management Sophomore Summer Analyst Program - Private Credit (New York)Investment ManagementNew York, United States of America Job # 19073Apply Now(opens in a new tab)                                             Application Deadline: Mar 28, 2025Program Type: InternshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has more than 1,400 investment professionals around the world and 1.7 trillion in assets under management or supervision as of December 31st, 2024. Morgan Stanley Investment Management strives to provide strong long-term investment performance, outstanding service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations, and individuals worldwide. General Description The Investment Management Summer Analyst Program is a 10-week program starting in June. The program consists of one week of training and nine weeks working within a specific IM team. Across all IM teams, the curriculum is designed to equip Summer Analysts with the fundamental skills they need to be successful in IM. During the 10-week program, Summer Analysts experience the culture and atmosphere of Morgan Stanley by performing a role similar to a Full-Time Analyst. Summer Analysts will be placed into a specific strategy team for their summer program, including Opportunistic Investing, Buyout Private Equity, Private Credit, Transformational Secondaries, and Venture. This role within MSIM is primarily a learning and growth opportunity, which does not necessarily correlate with full-time opportunities within the firm. Primary Responsibilities Work with senior members of the Fund to conduct diligence on investment opportunities Coordinate with advisors and consultants on due diligence items Help construct company financial forecast and valuation models Execute other investment related tasks (track prospective deals, help negotiate confidentiality agreements, etc.) Contribute to investment memoranda on investment opportunities Monitor performance of existing portfolio companies Keep current with market developments, such as new investment products and movements in the economy Develop your public speaking, company/industry research and analysis (qualitative), modeling, presentation building, and project management skills Job Requirements Pursuing a Bachelor's degree and will graduate between December 2027 and June 2028 Exceptional academic performance and communication skills, both verbal and written Strong team player; ability to collaborate with colleagues across the team and within the broader organization Self-starter with the ability to work independently Driven, highly motivated and results-focused Strong organizational and time management skills, with ability to manage projects and competing priorities Problem solver, with an analytical and detail-oriented mindset Keen interest in investing Application Process and Deadline In order to be considered, candidates must apply with their resume through the Morgan Stanley website and complete their HireVue digital questionnaire. Resumes will be reviewed on a rolling basis until the role is filled or the application deadline, whichever comes first. Applications must be submitted by Friday, March 28, 2025 at 11:55 PM EST and HireVues completed by Sunday, March 30, 2025 at 11:55 PM EST in order to be considered. Expected base pay rates for the role will be 36.06 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Investment Management Sophomore Summer Analyst Program - Secondaries (New York)Investment ManagementNew York, United States of America Job # 19074Apply Now(opens in a new tab)                                             Application Deadline: Mar 28, 2025Program Type: InternshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has more than 1,400 investment professionals around the world and 1.7 trillion in assets under management or supervision as of December 31st, 2024. Morgan Stanley Investment Management strives to provide strong long-term investment performance, outstanding service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations, and individuals worldwide. General Description The Investment Management Summer Analyst Program is a 10-week program starting in June. The program consists of one week of training and nine weeks working within a specific IM team. Across all IM teams, the curriculum is designed to equip Summer Analysts with the fundamental skills they need to be successful in IM. During the 10-week program, Summer Analysts experience the culture and atmosphere of Morgan Stanley by performing a role similar to a Full-Time Analyst. Morgan Stanley Private Equity Secondaries, an investment team within Morgan Stanley Investment Management, seeks to deliver innovative private market solutions to a global client base. As part of Morgan Stanley Private Credit & Equity (PC&E), a broader division of dedicated private markets focused professionals, the secondaries business draws on decades of investment experience across private markets. With a focus on GP-Led secondaries transactions in developed buyout and growth markets, the Team structures compelling opportunities within less efficient markets and has deployed over 4.6 billion to 54 GP-Led Continuation Vehicle transactions across North America and Europe, as of September 30, 2024. The Teams investment strategy focuses on GP-led private equity secondary transactions, primarily in situations that entail a restructuring or recapitalization of a single asset managed by a high quality lower middle market private equity sponsor. The Teams approach to each investment is bespoke, tailored to provide an optimal solution to each of the stakeholders in a transaction, which requires transaction expertise, thorough due diligence, and careful crafting to achieve the desired objectives for all parties involved. In addition to providing liquidity to existing limited partners, the key driving factors for these transactions typically include a variety of goals such as restoring alignment between the manager and investors, providing the manager with more time to create value, and financing tactical growth capital. In each situation, the Team approaches the transaction with the aim of providing a capital-based solution to the structural issue being addressed, with a core focus on ensuring strong alignment with a high caliber private equity sponsor and the Funds investors. Please refer to www.morganstanley.com/ideas for additional insights on the private equity secondaries market. This role within MSIM is primarily a learning and growth opportunity, which does not necessarily correlate with full-time opportunities within the firm. Primary Responsibilities: Construct, analyze, and modify detailed financial and LBO models and returns analyses Conduct market and company analysis on both quantitative and qualitative basis Participate in investment diligence meetings Prepare and present investment memos to the Investment Committee Support investment sourcing, client service requests, portfolio monitoring, and other organizational processes Job Requirements: Pursuing a Bachelor's degree and will graduate between December 2027 and June 2028 An understanding of financial concepts, valuation, and accounting Strong quantitative and qualitative analytical skills Strong verbal and written communication skills High level of attention-to-detail and strong work ethic Application Process and Deadline In order to be considered, candidates must apply with their resume through the Morgan Stanley website and complete their HireVue digital questionnaire. Resumes will be reviewed on a rolling basis until the role is filled or the application deadline, whichever comes first. Applications must be submitted by Friday, March 28, 2025 at 11:55 PM EST and HireVues completed by Sunday, March 30, 2025 at 11:55 PM EST in order to be considered. Expected base pay rates for the role will be 36.06 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025.2 Brazil Internship Program (Sao Paulo)Multiple Business AreasSao Paulo, Brazil Job # 19262Apply Now(opens in a new tab)                                             Application Deadline: Mar 28, 2025Program Type: InternshipProgram Description Ns acreditamos que o nosso maior ativo so as pessoas. Valorizamos o comprometimento com perspectivas diversas e uma cultura de incluso. Uma carreira no Morgan Stanley significa pertencer a uma cultura impulsionada por ideias, que busca novas vises para solucionar problemas complexos. Temos oportunidades para dois programas de estgio para atuar no nosso escritrio em So Paulo: Programa de Estgio Regular: para candidatos(as) que tenham disponibilidade de estagiar por um perodo de 1 ano at 2 anos, em modelo hbrido/presencial (a depender da disponibilidade da rea) no nosso escritrio em So Paulo. Programa de Estgio de Frias Morgan Stanley com Elas: voltado incluso de mulheres no mercado financeiro. Para candidatas que tenham disponibilidade de estagiar por um perodo de 5 semanas presencialmente no nosso escritrio em So Paulo. Voc poder ser selecionado(a) para trabalhar em qualquer rea, conforme disponibilidade das vagas, porm poder sinalizar suas reas de preferncia. Inscries at 27 de Maro PROGRAMA DE ESTGIO REGULAR MORGAN STANLEY BRASIL 2025.2 Confira mais informaes: Disponibilidade para estagiar por um perodo de 1 ano at 2 anos, em modelo hbrido/presencial (a depender da disponibilidade da rea) no nosso escritrio em So Paulo. Elegibilidade: Graduao prevista entre Julho/2026 e Julho/2027 - favor considerar a data final de formatura, incluindo possveis prorrogaes no momento da inscrio Idiomas: Ingls intermedirio Incio: A partir de Maio de 2025 Benefcios: bolsa estgio, auxlio transporte, vale refeio, seguro de vida, assistncia mdica, assistncia odontolgica, auxlio ingls, vale alimentao, 13 bolsa estgio e Wellhub Local de trabalho: So Paulo (Av. Faria Lima, 3600) PROGRAMA DE ESTGIO DE FRIAS MORGAN STANLEY BRASIL 2025: MORGAN STANLEY COM ELAS O Programa de Estgio de Frias: Morgan Stanley com Elas parte integrante de nossos esforos globais de recrutamento de diversidade. Nele voc ter a oportunidade de aprender sobre os papis e funes que compem nossa organizao localmente, alm de entender e conhecer melhor sobre o mercado financeiro O programa promover o networking para que voc expanda sua rede de relacionamento com os melhores profissionais do mercado e tambm uma agenda de capacitaes semanais. Confira mais informaes: Disponibilidade para estagiar presencialmente por um perodo de 5 semanas Quando: Julho de 2025 (01 de Julho a 01 de Agosto) Elegibilidade: Estudantes mulheres com previso de graduao entre Julho/2027 e Dezembro/2028 - favor considerar a data final de formatura, incluindo possveis prorrogaes no momento da inscrio Perodo de Estgio: 01 de Julho a 01 de Agosto 2025 Benefcios: bolsa estgio, auxlio transporte, vale refeio, seguro de vida, assistncia mdica Local de Trabalho: presencial em So Paulo (Av. Faria Lima, 3600) O PROCESSO SELETIVO DATAS IMPORTANTES 28/Fevereiro: Abertura do Perodo de Inscries 19/Maro: Webinar - Conhea mais sobre o Morgan Stanley 27/Maro: Fechamento do Perodo de Inscries 31 Maro a 6 Abril: Realizao de Testes 23 a 30 Abril: Entrevistas Individuais Maio: Retorno do Processo Seletivo A partir de Maio: Incio do Programa de Estgio 2025.2 01 de Julho: Incio do Programa de Frias: Morgan Stanley com Elas 2025 Quer saber mais sobre o Morgan Stanley? Participe do Webinar no dia 19/03 s 18h https://morganstanley.zoom.us/w/92578581147 FAQ PERGUNTAS RECORRENTES Estou tendo problemas para me inscrever no programa. Quem devo chamar? Voc deve entrar em contato com hrlatamrecruitment@morganstanley.com. Tenho dvidas sobre o Morgan Stanley e sobre o programa de estgio. O que devo fazer? Para saber mais sobre o Morgan Stanley e sobre o programa de estgio, participe do nosso Webinar no dia 19 de maro, s 18h, em: https://morganstanley.zoom.us/w/92578581147 Posso me inscrever para o Programa de Estgio e para o Programa de Estgio de Frias ao mesmo tempo? No. S poder ser considerada a candidatura para um nico programa. Quando realizar minha inscrio, posso escolher a rea que tenho interesse de atuar? Voc poder sinalizar as suas reas de preferncia porm o direcionamento final ser feito pelo time interno do banco (RH e gestores), conforme disponibilidade das vagas. Planejo adiar a minha data de graduao na universidade. Quando realizar minha inscrio, devo considerar qual data? Quando for completar a sua inscrio no nosso sistema, favor considerar a sua data final de formatura, incluindo possveis prorrogaes. At quando posso me inscrever para o programa? As inscries para o Programa de Estgio Morgan Stanley Brasil 2025.2 e para o Programa de Estgio de Frias: Morgan Stanley com Elas 2025 se encerram no dia 27 de maro. Perdi o prazo das inscries. Posso aplicar de alguma outra forma? Para garantimos a avaliao correta e igualitria de todos os currculos, recebemos todas as candidaturas diretamente pelo post da vaga. Caso voc tenha perdido o prazo das inscries e tenha interesse em fazer parte da equipe do Morgan Stanley, recomendamos que voc acompanhe os nossos canais oficiais de comunicao para no perder as inscries do nosso prximo programa. Estou com problemas na resoluo da entrevista virtual. Quem devo chamar? Caso tenha algum problema quando estiver realizando a sua entrevista virtual, entre em contato com hrlatamrecruitment@morganstanley.com. Estava realizando a etapa de testes online e minha internet caiu. O que eu fao? Entre novamente utilizando o site e login ID que foi disponibilizado e continue de onde parou. Por favor tenha em mente que isso no te dar tempo adicional para completar os testes. Quando fao log in no site mostra que est invalido ou expirado. O que isso significa? Isso significa que voc no completou os testes no perodo de 7 dias que foram indicados por voc por e-mail. Sua inscrio no ser mais considerada para esse programa, mas voc ser bem vindo para aplicar em um programa ou posio futura. Continuo com problemas na resoluo dos testes online. Quem devo chamar? Caso tenha algum problema quando estiver respondendo os testes, entre em contato com o nosso parceiro AON: morganstanley.support@aon.com. O prazo de resposta de 4 horas em dias teis e 24 horas aos finais de semana. No poderei participar da entrevista individual pois tive um conflito de agenda. Quem devo avisar? Voc deve entrar em contato com a pessoa que realizou o agendamento, informar o problema e reagendar a entrevista. Para outras dvidas e mais informaes, entre em contato com hrlatamrecruitment@morganstanley.comLearn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Quantitative Finance Off Cycle Internship (Paris)Institutional Securities GroupParis, France Job # 17685Apply Now(opens in a new tab)                                             Application Deadline: Mar 28, 2025Program Type: InternshipProgram Description PLACEMENT/DURATION The Morgan Stanley Quantitative Finance Off-Cycle Internship Program in Paris runs for six months and is aimed at students who are required to complete a long-term internship as part of their studies. It is designed to help you explore opportunities within Quantitative Finance by working with desk strategists to evolve into an integral member of the team. Quantitative Finance Interns are placed in a strategists (strats) team related to their specialism, but will typically be partnered with particular business lines or desks to work on specific projects or models. You can expect to take on significant responsibility as soon as you start. You will work directly with desks at a senior level, applying your skills and subject-matter expertise, to help them make strategic decisions, develop quantitative edge, drive efficiencies and effect changes. TRAINING PROGRAM Training includes on-the-job training and one-on-one sessions to familiarize yourself with the Firm's data resources, models, analytical tools, and AIML capability. The curriculum covers market and product knowledge as well as technical training. Throughout the program, you will be continually exposed to management, and you will benefit from networking opportunities with peers and colleagues. You will also be assigned a mentor to ease your transition into the corporate environment by offering career guidance, serving as a sounding board, and helping connect you to the broader Morgan Stanley network. Your co-workers are a diverse group who are motivated experienced industry leaders as well as graduates from top Universities that enjoy solving interesting problems in a collaborative environment. RESPONSIBILITIES Strategists typically work very closely with desks across business lines, are commercially driven and revenue focussed. The below four profiles describe the different categories of roles available within Strats. In many cases an individual role will encompass aspects of each. Electronic Trading Strategists are financial and software engineers who design, implement, back-test, deploy and measure sophisticated automated trading components and systematic trading strategies. Working closely with other Strategists and trading desks, they rapidly provide new solutions and bring efficiencies and quantitative edge to existing business processes within a dynamic market-driven environment. Desk Strategists use statistical techniques and machine learning to develop and optimise trading strategies, tools, components and flows. Working closely with Electronic Trading Strategists and trading desks, they apply rigorous quantitative research and portfolio construction techniques to design systematic trading strategies and models. Modelling Strategists use applied probability and numerical analysis to create pricing models and hedging strategies that drive trading decisions. Working closely with trading desks, they enhance Morgan Stanley's ability to trade innovative products and improve the management of the Firms trading risk. Data Strategists use advanced big data, machine learning and AI techniques to facilitate data usage, analysis and commercialisation. Closely work with trading desk and technology to develop cutting edge innovative ways to improve data infrastructure, quality and control. QUALIFICATIONS/SKILLS/REQS Curiosity, creativity, willingness to bring new ideas to the table, and approach problems differently Background in mathematics, statistics, engineering, computer science, or related field in an academic setting You have a keen interest in the financial markets and the drive and desire to work in a fast-paced, team-oriented environment Pragmatic approach to ensuring delivery on a timely basis You will possess practical problem solving skills with a great attention to detail You are able to communicate effectively in both written and verbal English You will be studying towards a Masters or PhD level degree and graduating in 2025 Note Please only submit a CV and Covering Letter in English only as part of your application You may be required to do a coding assessment as part of your application (you will be notified if this is required)Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Management Off-cycle Internship - Emerging Markets (London)Investment ManagementLondon, United Kingdom Job # 17636Apply Now(opens in a new tab)                                             Application Deadline: Mar 31, 2025Program Type: InternshipProgram Description PLACEMENT & DURATION Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide The Emerging Markets Debt team manages approximately 20 billion across a range of investment strategies. The team analyses the macroeconomic and political environments of more than one hundred countries and translates these fundamental views into investment ideas. Our research process leverages traditional news and crowd-sourced media, economic data releases, relationships with economists and political analysts, and on the ground travel to meet with policy makers and in-country experts. We exploit both long and short investment opportunities and use a variety of sovereign bonds, currencies, equities, and other cash and derivative instruments in order to execute our strategies. Our team is made up of highly motivated professionals with diverse backgrounds who complement our global perspective. The internship will commence in July 2025 and lasts twelve months. This internship offers you the opportunity to learn about a variety of areas, while providing a clear understanding of how Investment Management operates as a whole. Interns are treated as full-time members of the team and work alongside experienced professionals at all levels. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Gather, maintain, evaluate, and distribute macroeconomic data from disparate sources for use in the investment research process. Prepare daily news summaries for Portfolio Managers by monitoring various news sources for specific countries and regions Partake in research and due diligence conference calls and meetings. Interpret data, create visualizations, and communicate valuable information to the team. Assist the Director of Country Research and his team by completing ad hoc tasks and in-depth research projects QUALIFICATIONS/ SKILLS/ REQUIREMENTS You have graduated from university or able to take the time off to commit for a full time internship role for twelve months if you are currently in study Excellent record of academic achievement, with transcript as a proof You are fluent in English, with excellent verbal and written communication skills. An ability to communicate effectively in multiple languages would be an advantage You are adaptive, a leader yet team player, as well as a multi-tasker. You can present your conclusions in a clear and well-structured manner You have good presentation skills You have a keen interest in emerging markets, politics and economic policy You have strong analytical and numerical skills. You have knowledge and operating self-sufficiency in programming language(s) such as Python or R You have strong MS Office skills You are attentive to detail, well organized, and deadline oriented You have a positive attitude, strong work ethic and collaborativeLearn More(opens in a new tab)                                              STUDENTS & GRADUATES Equity Research (LATAM) - Analyst- Consumer (São Paulo, Brazil)Institutional Securities GroupSao Paulo, Brazil Job # 19255Apply Now(opens in a new tab)                                             Application Deadline: Mar 31, 2025Program Type: Full TimeProgram Description Equity Research The Equity Research department is responsible for researching macroeconomic and microeconomic conditions, along with company fundamentals. It also collects and analyses financial information to make investment recommendations on stocks in specific sectors. Research analysts build financial models to explore alternative scenarios, examine industries and communicate with companies and investors. Equity Research team members discuss their analysis and investment recommendations in research notes. A career in investment research at Morgan Stanley demands a commitment to excellence and a passion for the markets as well as the highest level of integrity. We are seeking an Analyst-level individual to join our Research team in Sao Paulo, Brazil. Experience with Equity Research Assist in writing research reports for initiations of stock coverage, analysis of data, earnings results, industry news, and thematic topics Create and maintain earnings, valuation and industry models leveraging skills in accounting, finance and economics Leverage all available resources to create differentiated content for research reports (company-specific or industry) Interact with institutional investors to discuss companies under coverage, investment theses, and respond to requests Keep abreast of industry-related news/industry developments flow and analyze implications for companies under coverage Develop and maintain relationships with investor relations personnel and management of companies under coverage Conduct industry diligence and primary research through surveys, expert conference calls, and various channel checks to evaluate industry trends Assist internal sales and trading teams in the timely analysis of breaking news in the sector Qualifications Experience utilizing Excel to Build / Maintain Financial models, an advanced level of excel proficiency is expected and required. Experience writing in a professional capacity, e.g. correspondence; presentation and/or development of industry reports High proficiency in spoken and written English language. Strong PowerPoint skills are required Expected to be adaptable and have the ability to work well under pressure Strong attention to detail is a must CFA is a plusLearn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Banking Off-cycle Internship (London)Institutional Securities GroupLondon, United Kingdom Job # 17565Apply Now(opens in a new tab)                                             Application Deadline: Mar 31, 2025Program Type: InternshipProgram Description PLACEMENT AND DURATION The Investment Banking Off-cycle Internship is an opportunity to experience the culture and atmosphere in the Investment Banking Division (IBD) by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. The internship typically lasts six months but can vary in length depending on business needs and candidate availability. You will spend your internship assigned to a specific group in a specific region, building basic skills in financial analysis, accounting, and valuation, while working on a wide range of domestic and international transactions. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Gathering and synthesising financial and operating information about companies, industries, and governments. Creating and updating financial models. Gathering market data to analyse trends and help value and price transactions. Drafting presentations and memoranda for a wider audience within the Firm and the financial services industry. Attending team discussions and client meetings, where you may be asked to deliver parts of a presentation. QUALIFICATIONS/SKILLS/REQUIREMENTS You have strong analytical and numerical skills that put you at ease with financial data. You are results-driven, and perform well under pressure and against tight deadlines. You are a proven team player and can manage a wide range of responsibilities. You have an excellent academic background and fluency in English and Spanish preferred. Ability to communicate effectively in multiple languages is an advantage. You articulate complex ideas simply and summarise them effectively. You are committed to excellence in your work and maintain high professional and ethical standards. APPLICATION DEADLINE We recruit on a rolling basis so application is encouraged as soon as possible. We aim to review all applications within a timely manner, however our response times may vary due to high volumes. Please be assured that you will receive an update via email as soon as a decision on your application has been reached, and kindly note we are unable to accommodate any requests to accelerate the timelines of our application process.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Investment Management Sophomore Summer Analyst Program - Next Level Fund (New York)Investment ManagementNew York, United States of America Job # 19072Apply Now(opens in a new tab)                                             Application Deadline: Apr 04, 2025Program Type: InternshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has more than 1,400 investment professionals around the world and 1.7 trillion in assets under management or supervision as of December 31st, 2024. Morgan Stanley Investment Management strives to provide strong long-term investment performance, outstanding service, and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations, and individuals worldwide. General Description The Investment Management Summer Analyst Program is a 10-week program starting in June. The program consists of one week of training and nine weeks working within a specific IM team. Across all IM teams, the curriculum is designed to equip Summer Analysts with the fundamental skills they need to be successful in IM. During the 10-week program, Summer Analysts experience the culture and atmosphere of Morgan Stanley by performing a role similar to a Full-Time Analyst. This role within MSIM is primarily a learning and growth opportunity, which does not necessarily correlate with full-time opportunities within the firm. Next Level Fund: The Next Level Fund is an early-stage venture fund investing in Series Seed to Series C technology and technology-enabled companies with a diverse or female founder. The fund Invests across industries including information technology, telecommunications and media, consumer, financial services, cybersecurity, proptech, healthcare, and business services. Primary Responsibilities: Work with senior members of the Fund to conduct diligence on investment opportunities Help construct company financial forecast and valuation models Execute other investment related tasks (track prospective deals, screen pitches and product demos, etc.) Contribute to investment memoranda on investment opportunities Monitor performance of existing portfolio companies Keep current with market developments, such as new investment products and movements in the economy Develop your public speaking, company/industry research and analysis (qualitative), modeling, presentation building, and project management skills Job Requirements: Pursuing a Bachelor's degree and will graduate between December 2027 and May 2028 Exceptional academic performance and communication skills, both verbal and written Strong team player; ability to collaborate with colleagues across the team and within the broader organization Self-starter with the ability to work independently Driven, highly motivated and results-focused Strong organizational and time management skills, with ability to manage projects and competing priorities Problem solver, with an analytical and detail-oriented mindset Keen interest in investing Application Process and Deadline In order to be considered, candidates must apply with their resume through the Morgan Stanley website and complete their HireVue digital questionnaire. Resumes will be reviewed on a rolling basis until the role is filled or the application deadline, whichever comes first. Applications must be submitted by Friday, April 4, 2025 at 11:55 PM EST and HireVues completed by Sunday, April 6, 2025 at 11:55 PM EST in order to be considered. Expected base pay rates for the role will be 36.06 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Global Capital Markets Industrial Placement Program (Sydney)Institutional Securities GroupSydney, Australia Job # 18449Apply Now                                             (opens in a new tab)Application Deadline: Apr 06, 2025Program Type: InternshipProgram Description 2025 Global Capital Markets Industrial Placement Program (Sydney) Job Description When clients need capital, Global Capital Markets (GCM) responds with market judgments and ingenuity. Whether executing an IPO, a debt offering or a leveraged buyout, GCM integrates Morgan Stanleys expertise in Sales and Trading and Investment Banking, offering clients seamless advice and sophisticated solutions. GCM originates, structures and executes public and private placement of equities, investment-grade and noninvestment-grade debt and related products. The group provides fresh ideas and broad distribution to help clients get the most out of each stage of a transaction, and continually develops capital markets solutions to enable clients to mitigate strategic, operational, credit and market risks. Our Industrial Placement Program is aimed at undergraduates who are either required by their degree or are able to complete a longer internship period. The six-month internship (June/July 2025 start depending on business needs and candidate availability) is designed to provide a realistic view of Global Capital Markets by having the interns assume the functions of Full-Time Analysts. Along the way, you will obtain a strong foundation in the basic skills of financial analysis and deal execution. You will be expected to start learning how to market the Firms products and services effectively. Training Program This intensive six-month program includes an orientation to Morgan Stanleys businesses and technical training. Your training will continue throughout the internship with structured learning sessions run by senior executives. Similarly, you will have many opportunities to integrate with peers and senior staff through a series of networking, social, charity and mentoring events. Role and Responsibilities The work is challenging, and Industrial Placement Interns are encouraged to roll up their sleeves, dig into financial statements and construct innovative solutions. You will spend the internship in Equity Capital Markets or Fixed Income Capital Markets, building a foundation of financial skills and a solid understanding of the markets. You will have a mentor and buddy aid in your development and to provide greater exposure to GCM and the Firm. You will be encouraged to take on responsibility quickly and help bridge various topics from new trends in the marketplace to group overviews. Qualifications and Skills You are pursuing an undergraduate Bachelors or Master's degree with a graduation date between June 2026 and February 2027. You have an ability to manage multiple projects, provide complicated financial analysis, and develop appropriate corporate finance solutions. Extraordinarily high level of motivation and attention to detail Strong written and verbal communication skills Commercial instinct and ability to perform under pressure and tight deadlines Interest in developing a career in Global Capital Markets Application Process and Deadline Application processes may vary by location but typically follows: CV Online Video Interview Interviews In order to be considered, candidates must apply by April 6, 2025 at 23:55 AEST.Learn More                                             (opens in a new tab) 123...8\n\n\n \n\tThere are currently no opportunities open.Please choose other filters to see different results.\n\tCLEAR ALL FILTERS TO SEE MORE OPPORTUNITIES\n\tRelated Opportunities",
  "timestamp": "2025-03-27T18:47:38.983Z",
  "previousTimestamp": "2025-03-26T21:17:37.515Z"
}