{
  "url": "https://www.morganstanley.com/careers/career-opportunities-search?opportunity=sg#",
  "contentHash": "f80fc45f1bb4489b0d080174a1f440a5",
  "content": "Career Opportunities\n        \n\n\n         \n\t\t\t  \n\t\t\t  \n\t\t\t  \n    \n        \n            \n        \n        \n        \n            \n        \n        \n    \n\t\n  \t\t\n    \n\n\n\n    \n\n\n\n    \n\n\n    \n\n\t\t\n    \n\n \n    Back\n    Help us find an opportunity best fit for you.\n\tWhat are you looking for?\n    \n\n    \n        \n            Jobs for  Experienced Professionals\n        You've honed your skill set. Now, use it to your full potential at Morgan Stanley.\n        \n             Opportunities for  Students and Graduates\n        Ready to launch your career with us? Learn about our internships, analyst programs and job openings.\n    \n\n\t\n    \n        \n        \n            \n                Select a location...\n            \n        \n        \n            GO\n        \n\n    \n\n    \n        Search for \n        \n            Quick Search\n            Search by job number or keyword\n            \n                \n                Job Number or Keyword\n                Please enter 3 or more characters\n            \n            Search\n            Search\n        \n        \n            \n                \n                    \n                      \n                    \n                    Sorry, your browser does not support inline SVG.\n                  \n                  OR\n            \n            \n                \n                    \n                      \n                    \n                    Sorry, your browser does not support inline SVG.\n                  \n                  OR\n            \n            \n        \n        \n            Guided Search\n            Filter by location, division, department, etc\n            GO TO GUIDED SEARCH\n            GO TO GUIDED SEARCH\n        \n    \n\n\n\n59 Results Found\nSort by Posted Date \n\n    \n     \n        \n            Filter By\n            Clear All\n        \n        \n            \n                Location\n                \n            \n            Where do you want to work?\n             \n                \n\t\t\t\t\tClear Selections\n                    \n                    \n                    \n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tSelect a location...\n                                    All Locations\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tAll States/Provinces\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tAll Cities\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n                    Add Another Location\n                \n            \n        \n        \n            \n                Business Area\n                \n                \n            \n            Which Business Areas and/or Divisions are you interested in ?\n\n            \n                \n                    Clear Selections\n                    \n                        \n                            \n                                 \n                                    \n                                     Institutional Securities\n                                \n                                \n                                    \n                                         \n                                             \n                                              Sales and Trading\n                                    \n                                    \n                                          Research\n                                                                                                                \n                                    \n                                          Global Capital Markets\n                                      \n                                    \n                                          Investment Banking\n                                      \n\t\t\t\t\t\t\t\t\t\n                                          Senior Relationship Management\n                                                                                                                     \n                                \n                            \n                        \n                    \n\n                    \n                        \n                            \n                                  Investment Management\n                            \n                            \n                                  Wealth Management\n                            \n                            \n                                  Operations\n                            \n                            \n                                  Technology\n                            \n                            \n                                  Firm Resilience\n                            \n                        \n                    \n\n                    \n                        \n                            \n                                 \n                                     \n                                      Company\n                                \n                                \n                                    \n                                          Administration\n                                    \n                                    \n                                          Company Management\n                                    \n                                    \n                                          Finance\n                                    \n                                    \n                                          Human Resources\n                                    \n                                    \n                                          Internal Audit\n                                    \n                                    \n                                          Legal and\n                                                Compliance\n                                    \n                                    \n                                          Risk Management\n                                    \n                                \n                            \n                        \n                    \n\n                \n            \n        \n\n        \n            \n                Employment Type\n                                                                                              \n                \n         \n         Which type of program you are looking for?\n                \n                    \n                      Clear Selections\n                        \n                            \n                                 \n                                        Full-Time\n                            \n                            \n                                 \n                                        Part-Time\n                            \n                            \n                                 \n                                        Intern\n                            \n                         \n\n                \n            \n        \n\n        \n                \n                    Jobs available in: English\n                    \n                \n                \n                                           \n                            \n                                \n                                     \n                                            English\n                                \n                            \n                        \n            \n            \n        START NEW SEARCHdone\n\n\n\n     Next \n     Done \n    All Experienced Professional Opportunities for Mainland China and Republic of Korea\n    \n    STUDENTS & GRADUATES2025 Investment Management Off-cycle Internship - Real Estate Investing (Madrid)Investment ManagementMadrid, Spain Job # 17627Apply Now(opens in a new tab)                                             Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT & DURATION Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. Morgan Stanley Real Estate Investing (REI) is Morgan Stanley's integrated global real estate practice. We are the world's leading global real estate investment manager with over 53 billion in real estate assets under management across core, value-added and opportunistic investment vehicles. REI acquires properties, operating companies, and real estate backed departments on a global scale on behalf of our institutional investors. The Off-Cycle Internship is an opportunity to experience the culture and atmosphere in the Investment Management Division by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. This internship will offer you an exciting and a dynamic work environment where you get to work alongside our diverse group of experienced professionals. The work that you do will be interesting and varied. The internship will commence by Q2 2025 and typically lasts six months but can vary in length depending on business needs and candidate availability.. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Collecting and synthesizing financial and operating information about potential investment opportunities and industries Creating financial models Gathering market data to analyse trends and help value and price transactions Drafting presentations and memoranda for a wider audience within the Firm Attending team discussions and partner meetings, where you may be asked to deliver parts of a presentation QUALIFICATIONS/ SKILLS/ REQUIREMENTS You have graduated from university or able to take the time off to commit for a full time internship role for six months if you are currently in study Fluency in English and in the local language based on the location you are applying for Ability to analyse and interpret complex information quickly and accurately Strong aptitude for numbers Ability to communicate complex ideas clearly and succinctly Temperament that thrives under pressure and changing situations Strong analytical and numerical skills that put you at ease with financial data Results-driven and able to perform well under pressure and against tight deadlines Proven team player with the ability to manage a wide range of responsibilities. Committed to excellence in your work and maintain high professional and ethical standardsLearn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Investment Banking Off-Cycle Internship (Johannesburg)Institutional Securities GroupJohannesburg, South Africa Job # 19181Apply Now(opens in a new tab)                                             Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT AND DURATION The Investment Banking Off-cycle Internship is an opportunity to experience the culture and atmosphere in the Investment Banking Division (IBD) by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. The internship typically lasts three to six months, but can vary in length depending on business needs and candidate availability. You will spend your internship assigned to a specific group in a specific region, building basic skills in financial analysis, accounting and valuation, while working on a wide range of domestic and international transactions. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Gathering and synthesising financial and operating information about companies, industries and governments. Creating and updating financial models. Gathering market data to analyse trends and help value and price transactions. Drafting presentations and memoranda for a wider audience within the Firm and the financial services industry. Attending team discussions and client meetings, where you may be asked to deliver parts of a presentation. QUALIFICATIONS/SKILLS/REQUIREMENTS You have strong analytical and numerical skills that put You at ease with financial data. You are results-driven, and perform well under pressure and against tight deadlines. You are a proven team player and can manage a wide range of responsibilities. You have an excellent academic background and fluency in English. Ability to communicate effectively in multiple languages is an advantage. You articulate complex ideas simply and summarise them effectively. You are committed to excellence in your work and maintain high professional and ethical standards. Salary is competitive with excellent benefits.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Management Off-cycle Internship - Real Estate Investing (Paris)Investment ManagementParis, France Job # 17640Apply Now(opens in a new tab)                                             Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT & DURATION Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. Morgan Stanley Real Estate Investing (REI) is Morgan Stanley's integrated global real estate practice. We are the world's leading global real estate investment manager with over 53 billion in real estate assets under management across core, value-added and opportunistic investment vehicles. REI acquires properties, operating companies, and real estate backed departments on a global scale on behalf of our institutional investors. The French REI team is looking for an Intern to join the local investing and asset management team. The selected candidate will support more senior professionals in the screening of market opportunities for new potential investments, as well as in the day-to-day asset management activities of existing investments. The internship will commence in July 2025 and typically lasts six months. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Collecting and synthesizing financial and operating information about potential investment opportunities and industries Creating financial models Gathering market data to analyse trends and help value and price transactions Drafting presentations and memoranda for a wider audience within the Firm Attending team discussions and partner meetings, where you may be asked to deliver parts of a presentation QUALIFICATIONS/ SKILLS/ REQUIREMENTS Fluency in English and in the local language based on the location you are applying for You are currently in study and be able to commit for a full-time internship role for six months Ability to analyse and interpret complex information quickly and accurately Strong aptitude for numbers Ability to communicate complex ideas clearly and succinctly Temperament that thrives under pressure and changing situations Strong analytical and numerical skills that put you at ease with financial data Results-driven and able to perform well under pressure and against tight deadlines Proven team player with the ability to manage a wide range of responsibilities. Committed to excellence in your work and maintain high professional and ethical standardsLearn More(opens in a new tab)                                              STUDENTS & GRADUATES 2025 Recursos Humanos, Brasil - Programa de AprendizCompanySao Paulo, Brazil Job # 19274Apply Now(opens in a new tab)                                             Application Deadline: Apr 14, 2025Program Type: High School InternshipProgram Description Vaga Jovem Aprendiz em Recursos Humanos Morgan Stanley O Morgan Stanley uma empresa lder global em servios financeiros que oferece uma ampla gama de servios bancrios de investimento, ttulos, gesto de investimentos e gesto de patrimnio. Trabalhamos para oferecer um ambiente de apoio e incluso onde todos os indivduos possam maximizar todo o seu potencial. Nossa fora de trabalho qualificada e criativa composta por indivduos extrados de uma ampla seo transversal das comunidades globais nas quais operamos e que refletem uma variedade de origens, talentos, perspectivas e experincias. Nosso forte compromisso com uma cultura de incluso evidente por meio de nosso foco constante em recrutar, desenvolver e promover indivduos com base em suas habilidades e talentos. Responsabilidades: Demonstrar forte iniciativa, pensamento e soluo de problemas; Forte comunicao verbal e escrita; Adaptabilidade e disposio para aprender; Suporte a equipe de Talent Acquisition Brasil. Requisitos Vaga afirmativa para mulheres e/ou pessoas negras; Ter entre 18 e 21 anos; Disponibilidade para trabalhar presencialmente no escritrio em So Paulo (Av. Brigadeiro Faria Lima, 3600) 4 vezes por semana, e realizar curso de aprendizagem na sexta-feira. Benefcios Bolsa Auxlio ingls; Vale Refeio; Vale Transporte; Plano de Sade.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Management Apprenticeship - Global Sales and Marketing (Paris)Investment ManagementParis, France Job # 19188Apply Now(opens in a new tab)                                             Application Deadline: Apr 14, 2025Program Type: ApprenticeshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. MSIM Sales teams are responsible for raising capital for investment teams. Sales teams introduce prospective clients to MSIM and present investment capabilities that meet requirements specified by the client. To do this, they must understand client needs, markets and competitors, maintain strong relationships and co-ordinate communication and activities between multiple parts of the organisation. Sales teams are the key points of contact with prospective and existing clients and are the key relationship owners throughout the client lifecycle. Sales provide coverage across the institutional and intermediary channels and are organized geographically: North America, Europe, Middle East and Africa, Latin America, Asia (ex Japan/China), Japan and China. The Apprenticeship is an opportunity to experience the culture and atmosphere in the Investment Management Division by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. The programme will commence in July 2025 and typically lasts twelve months. Training program You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. Responsibilities Include: Preparation of pitch books, client due diligence or market research to support senior sales people in their client interactions; Sourcing and providing relevant material to service prospective and existing clients who may require performance reviews and fund analysis; Liaise between clients and internal business units to ensure operational, legal and reporting needs are met; Responsible for the maintenance of client records, sales pipeline, marketing distribution lists, client mapping and sales reports. Qualifications/ Skills/ Requirements You are currently in study and be able to commit for this apprenticeship role for twelve months You have outstanding analytical and quantitative skills. You have excellent communication skills, both verbal and written. You have an excellent academic background and fluency in English as well as in the language of the country you are applying for. You are a strong team player; ability to collaborate with colleagues across MSIM and the broader organization. You are a self-starter with the ability to work independently. You are driven, highly motivated and results-focused. You have strong organizational skills with the ability to manage time efficiently and effectively. You are detail oriented and have the ability to work efficiently within tight time constraints.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Global Capital Markets Summer Analyst Program (New York)Institutional Securities GroupNew York, United States of America Job # 18969Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description Morgan Stanley's Global Capital Markets division offers a 10-week program that takes place at Morgan Stanleys headquarters in New York. The program includes opportunity to be placed on one of our desks within Global Capital Markets (GCM), which could include: Equity Capital Markets (ECM), Fixed Income Capital Markets (FICM), Leveraged Finance (LevFin), Securitized Products Capital Markets (SPCM), Liability Management, Project Finance, or Strategic Lending Group (SLG); a training and orientation with a variety of presentations, coursework, and exercises with experts and industry leaders; a formal mentorship program to aid in your development and provide greater exposure to GCM. The summer program includes, but is not limited to, engagement with senior leadership, lunch & learn sessions, regular networking events, and interaction with other businesses across the Firm, a market driven environment with an open trading floor where you are closely integrated with your team, a flat structure experience that will provide you with a high level of responsibility early in your career. Program Overview Responsibilities may include but are not limited to: Work with our clients on complex, innovative financing, and risk management solutions Learn how to read complex financial models and understand basic multiples such as P/E and Aggregate Value/EBITDA Learn how equity deals are priced and play an active role in the origination and execution of transactions, while working closely with your Corporate Finance counterparts in Investment Banking Help prepare materials to provide clients with valuable updates on market news and trends and how these affect their access to the debt capital markets Work with our trading and syndicate desks on rate views, product management and deal execution; build and run complex financial models. Analyze and create, for both corporate and financial sponsors, various financing alternatives in the context of debt and/or loan financing, leveraged buyouts and acquisition financings Qualifications & Skills Pursuing a Bachelor's degree and will graduate between December 2026 and Spring 2027 Basic knowledge of and a keen interest in finance Outstanding analytical and quantitative skills A great multi-tasker, possess a strong work ethic, and have a positive attitude Excellent verbal and written communication skills A quick learner, both a leader and team player, and a self-starter with the ability to work independently Detail oriented with strong organizational skills and ability to manage time efficiently and effectively Application Details We review Global Capital Markets applications on a rolling basis and encourage you to apply as soon as you are ready because interviews can occur prior to the application period closing, which is Tuesday, April 15. Expected base pay rates for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Equity Research Summer Analyst Program (New York)Institutional Securities GroupNew York, United States of America Job # 18928Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description During this 10-week program, Summer Analysts are placed directly into one of the following sector teams: Consumer, Energy, Utilities, Financials, Healthcare, Industrials, Materials, Media, Telecommunication or Technology. The placements are made based on the needs of the department and the skill set of the candidate. The Summer Analyst Program begins with a training and development curriculum that covers the fundamental and professional skills you need for success in Equity Research. After a brief training period, Summer Analysts will be assigned to a specific industry group, building a foundation in the basic skills of fundamental analysis, accounting and valuation. There will be networking opportunities and ongoing training throughout the program. Role and Responsibilities Gather and analyze industry data to develop an industry-specific vision. Update and build financial models on the companies and industry you follow. Analyze emerging trends in an industry or macro economy. Assess relative stock valuations and review findings with your team. Build relationships within Sales & Trading and Research. Qualifications and Skills You are pursuing an undergraduate Bachelors degree with a graduation date of December 2026 or Spring 2027. Minimum 3.0 GPA. You have basic knowledge of and a keen interest in finance. You are analytical, adaptive, possess an excellent work ethic, are a leader yet team player, as well as a multi-tasker. You possess proficient oral and written communication skills. Applications will be reviewed on a rolling basis and we encourage you to apply as soon as you are ready. In order to be considered a complete application, students must submit an application and complete a HireVue (instructions emailed upon submission of application). Applications will close on Tuesday, April 15. Expected base pay rates for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Fund Services Summer Analyst Program (New York & Purchase)Institutional Securities GroupNew York, United States of America Job # 18960Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description Overview Morgan Stanley Fund Services (MSFS) is a leading fund administration business with 500 billion assets under administration and 1,000+ professionals across New York, London, Dublin, Glasgow, Mumbai, Bangalore and Hong Kong. MSFS services a global institutional client base, providing hedge funds, multi-asset class investors, family offices and private equity firms with innovative product solutions. Primarily, MSFS provides accounting, investor servicing, reporting, tax, middle and back-office support, and portfolio analytics. MSFS employees work closely with the Chief Operating Officers, Chief Financial Officers, Portfolio Managers and investors of our clients. Duration The MSFS Summer Analyst Program is a 10-week program that begins with one week of classroom training, followed by four rotations across the business. Summer Analysts will be placed with our Investor Services, Middle Office, Product Development and the Anti-Money Laundering team and spend time in both the New York and Purchase offices. All Summer Analysts will receive on-the-job training and exposure to a wide variety of roles, products and services throughout MSFS, working alongside experienced professionals in a fast-paced, client-facing, and market-driven environment. Summer Analysts will have the opportunity to broaden and strengthen their respective skillsets, collaborating with individuals across MSFS on meaningful projects and initiatives. In addition, the Program features a Senior Management Speaker Series, teach-ins, cross-divisional networking events, community service events, performance reviews, and a robust mentorship program. Training Program The program begins with a one-day orientation where Summer Analysts are introduced to the Firm and primary businesses, as well as to one another at our opening Firmwide networking event. For the remainder of training, Summer Analysts will attend divisional-specific events designed to help develop the core skills required for a successful summer. Placements Investor Services (IS): IS works closely with the Investor Relations, Chief Financial Officers, Chief Operating Officers, Compliance teams and investors of our clients. Further, IS supports our clients with investor capital activity (e.g., subscriptions, redemptions, transfers and assignments) and cash movements to and from the client. The IS team is responsible for supporting the fund manager/investor relationship and core responsibilities include onboarding investors, processing investor documents and managing investor communications. Middle Office (MO): The MO team works closely with the Chief Operating Officers, Directors of Operations, and Treasury Managers of our clients to facilitate their Trades Management and/or Cash & Collateral Management needs, including trade processing, positions and cash reconciliations and corporate actions; as well as manage collateral and monitor cash flows. Product Development: Our Product Development team works across MSFS functions to set technology priorities that enhance MSFS products and platforms for our clients. The team works with our clients and colleagues to better understand technology needs and translate those needs to technology requirements that will be used to design new and enhanced products. Anti-Money Laundering (AML): The AML team is responsible for helping our clients identify and manage potential AML risks. The team works closely with the General Counsel, Compliance, and Investor Relations representatives at our clients. Day-to-day responsibilities include the management of AML documentation, serving as a point of contact for fund managers and their investors. Qualifications / Skills / Requirements: Current undergraduate student with a graduation date of December 2026 or Spring 2027 Strong analytical interpersonal, verbal and written communication skills Collaborative, quick learner, adaptable, enjoy solving problems, possess a strong work ethic and ability to multi-task A keen interest in finance and markets Applications will be reviewed on a rolling basis and we encourage you to apply as soon as you are ready. In order to be considered a complete application, students must submit an application and complete a HireVue (instructions emailed upon submission of application). Applications will close on Tuesday, April 15. Expected base pay rate(s) for the role will be 43.27 per hour at the commencement of employment. However, base pay is only part of the total compensation package, which, depending on the position, may also include discretionary bonuses and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Fixed Income Summer Analyst Program (New York)Institutional Securities GroupNew York, United States of America Job # 18957Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description The Fixed Income Summer Analyst Program is a 10-week program consisting of one week of classroom training, followed by multiple rotations across Fixed Income. Rotations may include Global Credit & Municipals, Securitized Products, Foreign Exchange/Emerging Markets, Interest Rates, and Commodities. Summer Analysts receive on-the-job training, benefit from working alongside experienced professionals on meaningful projects, and build their skillsets in a dynamic and evolving environment. In addition, the program features a Senior Management Speaker Series, desk teach-ins, networking events, community service, performance reviews, and a robust mentorship program. Program Overview Summer Analysts begin with a one-day orientation where they are introduced to the Firms businesses and learn what its like to be an employee at Morgan Stanley. Fixed Income Summer Analysts then attend Sales & Trading division-specific training where they learn core skills essential for success. The curriculum includes daily market updates, business-specific overviews, and basic product and technical training. Role & Responsibilities Sales: Understand how a client base is developed and maintained; create investment ideas; learn how we sell and cross-sell the Firms products; represent the Firm when interfacing with clients on important business issues. Trading: Assist in generating trade ideas and analysis; support all aspects of the market-making and trade execution process, from providing research analytics on trades to relative value analysis. Strategy: Help develop investment recommendations on Fixed Income Securities through the study and analysis of market fundamentals and technical research. Understand how we use the existing firm model database to develop new models. Structuring: Learn how to build valuation models to help issuers and investors optimize a transactions economics, and quantify sources of value and risk. Qualifications & Skills You are pursuing an undergraduate Bachelors degree (junior) or a Masters with a graduation date of December 2026 or Spring 2027. Minimum 3.0 GPA. While no prior knowledge of finance or sales & trading is required, you must have a keen interest in finance and markets. You are analytical, adaptive, possess a strong work ethic, are a leader yet team player, as well as a multi-tasker. You possess strong oral and written communication skills. Applications will be reviewed on a rolling basis and we encourage you to apply as soon as you are ready. In order to be considered a complete application, students must submit an application and complete a HireVue (instructions emailed upon submission of application). Applications will close on Tuesday, April 15. Expected base pay rates for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Institutional Securities Group Risk Management Summer Analyst Program (New York)New York, United States of America Job # 18990Apply Now                                             (opens in a new tab)Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description The Institutional Securities Group Risk Management (ISG Risk) Summer Analyst Program is a 10-week program consisting of one week of classroom training followed by nine weeks of rotations across ISG Risk. ISG Risk is a first line risk management function which includes divisional and ISG Counterparty Risk, ISG Central Risk (CRT), and divisional Business Control Units (BCU). Counterparty risk is responsible for monitoring and managing counterparty risk generated by the ISG businesses at the division and ISG level. ISG Central Risk Team is responsible for creating and implementing the Non-Financial Risk framework centrally across ISG businesses, including, regulatory, supervision, data, cyber, model and trader mandate, ESG and financial crimes risk. Business Control Unit teams work with the Central Risk team and support each business in risk initiatives. Summer Analysts will rotate through a combination of our ISG Counterparty Risk, Central Risk and Business Control Unit teams. The Program features a senior management speaker series, networking events, community service, a performance review and a mentorship program. Summer Analysts receive continued on-the-job training and benefit from working alongside experienced professionals on meaningful projects. In addition to daily responsibilities on the desk, Summer Analysts will be assigned a summer-long project based on their rotations, which is presented to management at the end of the summer. Summer Analysts begin with a one-week orientation where they are introduced to the Firm's businesses and learn what it is like to be an employee at Morgan Stanley. ISG Risk Summer Analysts then attend Sales and Trading division-specific training, accompanied by an additional ISG Risk-focused training day, teaching them core skills essential for a successful summer. The curriculum includes daily market updates, business-specific overviews and basic product and technical training. Qualifications/Skills/Requirements You are pursuing an undergraduate Bachelors or Master's degree with a graduation date of December 2026 or Spring 2027. Minimum 3.0 GPA. You have basic knowledge and a keen interest in finance. You are analytical, adaptive, collaborative, a leader, and a multi-tasker. You possess strong oral and written communication skills. Expected base pay rate for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More                                             (opens in a new tab) \n\n\n \n\tThere are currently no opportunities open.Please choose other filters to see different results.\n\tCLEAR ALL FILTERS TO SEE MORE OPPORTUNITIES\n\tRelated Opportunities \n\t\n \n\n\n\n\n\n\n\n\n\n59 Results Found\nSort by Application Deadline \n\n \n    \n        Filter By\n        Clear All\n    \n    \n        \n            Location\n            \n        \n        Where do you want to work?\n         \n            \n                \n                Clear SelectionsAmericasEurope, Middle East, AfricaJapanNon-Japan Asia\n                        \n                            \n                                \n                                    Select a location...\n                                    All Locations\n                                ArgentinaBrazilCanadaChileColombiaCosta RicaEcuadorGuatemalaMexicoPanamaPeruTrinidad and TobagoUnited States of AmericaUruguay\n                            \n                            \n                                \n                                    All States/Provinces\n                                \n                            \n                            \n                                \n                                    All Cities\n                                \n                            \n                        \n                    Add Another Location\n                    \n                \n            \n        \n    \n    \n        \n            Business Area\n            \n            \n        \n        Which Business Areas and/or Divisions are you interested in ?\n     \n        \n            Clear Selections\n                \n                    \n                        \n                             \n                                \n                                 Institutional Securities Group\n                            \n                            \n                                \n                                      Investment Banking\n                                                                    \n                                \n                                      Global Capital Markets\n                                \n                                \n                                      Sales and Trading\n                                \n                                \n                                      Research\n                                \n\n                                \n                                      Quantitative Finance\n                                \n                                \n                                      Global Sustainable Finance\n                                \n                            \n                        \n                    \n                \n\n                \n\t\t\t\t\t\t\n                            \n                                  Investment Management\n                            \n                            \n                                  Operations\n                            \n                            \n                                  Technology\n                            \n\t\t\t\t\t\t\t\n                             \n                                \n                                 Wealth Management\n                            \n                            \n                                \n                                      Wealth Management\n                                 \n                                \n                                      Morgan Stanley Bank\n                                  \n                    \t\t\n\n                    \n                \n\n                \n                    \n                        \n                              Company \n                            \n                            \n                                \n                                      Corporate Services\n                                \n                                \n                                      Corporate Affairs\n                                \n                                \n                                      Company Management\n                                \n                                \n                                      Legal and Compliance\n\t\t\t\t\t\t\t\t\n\n                                \n                                      Finance\n                                \n                                \n                                          Firm Risk Management\n\t\t\t\t\t\t\t\t\t\n                                \n                                \n                                      Human Resources\n                                \n                                \n                                      Internal Audit\n                                \n                            \n                        \n                    \n                \n\n            \n        \n    \n\n    \n        \n            Education Level\n            \n            \n        \n        \n        What is your education level?\n        \n            \n                    Clear Selections\n                    \n                            \n                                 \n                                        Associate's Degree/College Diploma\n                            \n                            \n                                 \n                                                Bachelor's Degree\n                            \n                            \n                                 \n                                                Doctorate Degree\n                            \n                            \n                                 \n                                                High School Diploma/GED\n                            \n                            \n                                 \n                                        Master's Degree\n                            \n                            \n                                 \n                                        Masters of Business Administration\n                            \n                            \n                                 \n                                        None\n                            \n                                               \n            \n\n        \n    \n\n    \n        \n            Program Type\n            \n            \n     \n     Which type of program you are looking for?\n            \n                \n                        Clear Selections                                        \n                    \n                        \n                             \n                                    Apprenticeship\n                        \n                        \n                             \n                                    Diversity Event/Program\n                        \n                        \n                             \n                                    Full-Time\n                        \n                        \n                             \n                                    High School Internship\n                        \n                        \n                             \n                                    Internship\n                        \n                     \n\n            \n        \n    \n\n    \n            \n                Jobs available in: English\n                \n            \n                \n                                           \n                            \n                                \n                                     \n                                            English\n                                \n                                \n                                     \n                                            Francais\n                                \n                            \n                        \n            \n            \n    START NEW SEARCHdone\n\n     Next \n     Done \n    All Students & Graduates Opportunities\n    \n\n\nSTUDENTS & GRADUATES2025 Investment Management Off-cycle Internship - Real Estate Investing (Madrid)Investment ManagementMadrid, Spain Job # 17627Apply Now(opens in a new tab)                                             Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT & DURATION Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. Morgan Stanley Real Estate Investing (REI) is Morgan Stanley's integrated global real estate practice. We are the world's leading global real estate investment manager with over 53 billion in real estate assets under management across core, value-added and opportunistic investment vehicles. REI acquires properties, operating companies, and real estate backed departments on a global scale on behalf of our institutional investors. The Off-Cycle Internship is an opportunity to experience the culture and atmosphere in the Investment Management Division by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. This internship will offer you an exciting and a dynamic work environment where you get to work alongside our diverse group of experienced professionals. The work that you do will be interesting and varied. The internship will commence by Q2 2025 and typically lasts six months but can vary in length depending on business needs and candidate availability.. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Collecting and synthesizing financial and operating information about potential investment opportunities and industries Creating financial models Gathering market data to analyse trends and help value and price transactions Drafting presentations and memoranda for a wider audience within the Firm Attending team discussions and partner meetings, where you may be asked to deliver parts of a presentation QUALIFICATIONS/ SKILLS/ REQUIREMENTS You have graduated from university or able to take the time off to commit for a full time internship role for six months if you are currently in study Fluency in English and in the local language based on the location you are applying for Ability to analyse and interpret complex information quickly and accurately Strong aptitude for numbers Ability to communicate complex ideas clearly and succinctly Temperament that thrives under pressure and changing situations Strong analytical and numerical skills that put you at ease with financial data Results-driven and able to perform well under pressure and against tight deadlines Proven team player with the ability to manage a wide range of responsibilities. Committed to excellence in your work and maintain high professional and ethical standardsLearn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Investment Banking Off-Cycle Internship (Johannesburg)Institutional Securities GroupJohannesburg, South Africa Job # 19181Apply Now(opens in a new tab)                                             Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT AND DURATION The Investment Banking Off-cycle Internship is an opportunity to experience the culture and atmosphere in the Investment Banking Division (IBD) by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. The internship typically lasts three to six months, but can vary in length depending on business needs and candidate availability. You will spend your internship assigned to a specific group in a specific region, building basic skills in financial analysis, accounting and valuation, while working on a wide range of domestic and international transactions. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Gathering and synthesising financial and operating information about companies, industries and governments. Creating and updating financial models. Gathering market data to analyse trends and help value and price transactions. Drafting presentations and memoranda for a wider audience within the Firm and the financial services industry. Attending team discussions and client meetings, where you may be asked to deliver parts of a presentation. QUALIFICATIONS/SKILLS/REQUIREMENTS You have strong analytical and numerical skills that put You at ease with financial data. You are results-driven, and perform well under pressure and against tight deadlines. You are a proven team player and can manage a wide range of responsibilities. You have an excellent academic background and fluency in English. Ability to communicate effectively in multiple languages is an advantage. You articulate complex ideas simply and summarise them effectively. You are committed to excellence in your work and maintain high professional and ethical standards. Salary is competitive with excellent benefits.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Management Off-cycle Internship - Real Estate Investing (Paris)Investment ManagementParis, France Job # 17640Apply Now(opens in a new tab)                                             Application Deadline: Apr 13, 2025Program Type: InternshipProgram Description PLACEMENT & DURATION Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. Morgan Stanley Real Estate Investing (REI) is Morgan Stanley's integrated global real estate practice. We are the world's leading global real estate investment manager with over 53 billion in real estate assets under management across core, value-added and opportunistic investment vehicles. REI acquires properties, operating companies, and real estate backed departments on a global scale on behalf of our institutional investors. The French REI team is looking for an Intern to join the local investing and asset management team. The selected candidate will support more senior professionals in the screening of market opportunities for new potential investments, as well as in the day-to-day asset management activities of existing investments. The internship will commence in July 2025 and typically lasts six months. TRAINING PROGRAM You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. RESPONSIBILITIES Collecting and synthesizing financial and operating information about potential investment opportunities and industries Creating financial models Gathering market data to analyse trends and help value and price transactions Drafting presentations and memoranda for a wider audience within the Firm Attending team discussions and partner meetings, where you may be asked to deliver parts of a presentation QUALIFICATIONS/ SKILLS/ REQUIREMENTS Fluency in English and in the local language based on the location you are applying for You are currently in study and be able to commit for a full-time internship role for six months Ability to analyse and interpret complex information quickly and accurately Strong aptitude for numbers Ability to communicate complex ideas clearly and succinctly Temperament that thrives under pressure and changing situations Strong analytical and numerical skills that put you at ease with financial data Results-driven and able to perform well under pressure and against tight deadlines Proven team player with the ability to manage a wide range of responsibilities. Committed to excellence in your work and maintain high professional and ethical standardsLearn More(opens in a new tab)                                              STUDENTS & GRADUATES 2025 Recursos Humanos, Brasil - Programa de AprendizCompanySao Paulo, Brazil Job # 19274Apply Now(opens in a new tab)                                             Application Deadline: Apr 14, 2025Program Type: High School InternshipProgram Description Vaga Jovem Aprendiz em Recursos Humanos Morgan Stanley O Morgan Stanley uma empresa lder global em servios financeiros que oferece uma ampla gama de servios bancrios de investimento, ttulos, gesto de investimentos e gesto de patrimnio. Trabalhamos para oferecer um ambiente de apoio e incluso onde todos os indivduos possam maximizar todo o seu potencial. Nossa fora de trabalho qualificada e criativa composta por indivduos extrados de uma ampla seo transversal das comunidades globais nas quais operamos e que refletem uma variedade de origens, talentos, perspectivas e experincias. Nosso forte compromisso com uma cultura de incluso evidente por meio de nosso foco constante em recrutar, desenvolver e promover indivduos com base em suas habilidades e talentos. Responsabilidades: Demonstrar forte iniciativa, pensamento e soluo de problemas; Forte comunicao verbal e escrita; Adaptabilidade e disposio para aprender; Suporte a equipe de Talent Acquisition Brasil. Requisitos Vaga afirmativa para mulheres e/ou pessoas negras; Ter entre 18 e 21 anos; Disponibilidade para trabalhar presencialmente no escritrio em So Paulo (Av. Brigadeiro Faria Lima, 3600) 4 vezes por semana, e realizar curso de aprendizagem na sexta-feira. Benefcios Bolsa Auxlio ingls; Vale Refeio; Vale Transporte; Plano de Sade.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2025 Investment Management Apprenticeship - Global Sales and Marketing (Paris)Investment ManagementParis, France Job # 19188Apply Now(opens in a new tab)                                             Application Deadline: Apr 14, 2025Program Type: ApprenticeshipProgram Description Morgan Stanley Investment Management (MSIM), together with its investment advisory affiliates, has about 1.5 trillion in assets under management or supervision. With 1,419 investment professionals worldwide, and 55 offices in 24 countries, Morgan Stanley Investment Management is able to provide in-depth local knowledge and expertise while channelling the strength of our global presence and resources. To support the delivery of tailored, value-added investment solutions to clients our investment teams are organized by capability: Solutions & Multi-Asset, Real Assets, Active Fundamental Equity, Private Credit & Equity, Global Fixed Income, and Global Liquidity. Morgan Stanley Investment Management strives to provide outstanding long-term investment performance, service and a comprehensive suite of investment management solutions to a diverse client base, which includes governments, institutions, corporations and individuals worldwide. MSIM Sales teams are responsible for raising capital for investment teams. Sales teams introduce prospective clients to MSIM and present investment capabilities that meet requirements specified by the client. To do this, they must understand client needs, markets and competitors, maintain strong relationships and co-ordinate communication and activities between multiple parts of the organisation. Sales teams are the key points of contact with prospective and existing clients and are the key relationship owners throughout the client lifecycle. Sales provide coverage across the institutional and intermediary channels and are organized geographically: North America, Europe, Middle East and Africa, Latin America, Asia (ex Japan/China), Japan and China. The Apprenticeship is an opportunity to experience the culture and atmosphere in the Investment Management Division by taking on some of the responsibilities and functions of a Full-time Analyst for a short period. The programme will commence in July 2025 and typically lasts twelve months. Training program You will receive on-the-job training and benefit from working alongside experienced professionals on a variety of projects. Responsibilities Include: Preparation of pitch books, client due diligence or market research to support senior sales people in their client interactions; Sourcing and providing relevant material to service prospective and existing clients who may require performance reviews and fund analysis; Liaise between clients and internal business units to ensure operational, legal and reporting needs are met; Responsible for the maintenance of client records, sales pipeline, marketing distribution lists, client mapping and sales reports. Qualifications/ Skills/ Requirements You are currently in study and be able to commit for this apprenticeship role for twelve months You have outstanding analytical and quantitative skills. You have excellent communication skills, both verbal and written. You have an excellent academic background and fluency in English as well as in the language of the country you are applying for. You are a strong team player; ability to collaborate with colleagues across MSIM and the broader organization. You are a self-starter with the ability to work independently. You are driven, highly motivated and results-focused. You have strong organizational skills with the ability to manage time efficiently and effectively. You are detail oriented and have the ability to work efficiently within tight time constraints.Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Global Capital Markets Summer Analyst Program (New York)Institutional Securities GroupNew York, United States of America Job # 18969Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description Morgan Stanley's Global Capital Markets division offers a 10-week program that takes place at Morgan Stanleys headquarters in New York. The program includes opportunity to be placed on one of our desks within Global Capital Markets (GCM), which could include: Equity Capital Markets (ECM), Fixed Income Capital Markets (FICM), Leveraged Finance (LevFin), Securitized Products Capital Markets (SPCM), Liability Management, Project Finance, or Strategic Lending Group (SLG); a training and orientation with a variety of presentations, coursework, and exercises with experts and industry leaders; a formal mentorship program to aid in your development and provide greater exposure to GCM. The summer program includes, but is not limited to, engagement with senior leadership, lunch & learn sessions, regular networking events, and interaction with other businesses across the Firm, a market driven environment with an open trading floor where you are closely integrated with your team, a flat structure experience that will provide you with a high level of responsibility early in your career. Program Overview Responsibilities may include but are not limited to: Work with our clients on complex, innovative financing, and risk management solutions Learn how to read complex financial models and understand basic multiples such as P/E and Aggregate Value/EBITDA Learn how equity deals are priced and play an active role in the origination and execution of transactions, while working closely with your Corporate Finance counterparts in Investment Banking Help prepare materials to provide clients with valuable updates on market news and trends and how these affect their access to the debt capital markets Work with our trading and syndicate desks on rate views, product management and deal execution; build and run complex financial models. Analyze and create, for both corporate and financial sponsors, various financing alternatives in the context of debt and/or loan financing, leveraged buyouts and acquisition financings Qualifications & Skills Pursuing a Bachelor's degree and will graduate between December 2026 and Spring 2027 Basic knowledge of and a keen interest in finance Outstanding analytical and quantitative skills A great multi-tasker, possess a strong work ethic, and have a positive attitude Excellent verbal and written communication skills A quick learner, both a leader and team player, and a self-starter with the ability to work independently Detail oriented with strong organizational skills and ability to manage time efficiently and effectively Application Details We review Global Capital Markets applications on a rolling basis and encourage you to apply as soon as you are ready because interviews can occur prior to the application period closing, which is Tuesday, April 15. Expected base pay rates for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Equity Research Summer Analyst Program (New York)Institutional Securities GroupNew York, United States of America Job # 18928Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description During this 10-week program, Summer Analysts are placed directly into one of the following sector teams: Consumer, Energy, Utilities, Financials, Healthcare, Industrials, Materials, Media, Telecommunication or Technology. The placements are made based on the needs of the department and the skill set of the candidate. The Summer Analyst Program begins with a training and development curriculum that covers the fundamental and professional skills you need for success in Equity Research. After a brief training period, Summer Analysts will be assigned to a specific industry group, building a foundation in the basic skills of fundamental analysis, accounting and valuation. There will be networking opportunities and ongoing training throughout the program. Role and Responsibilities Gather and analyze industry data to develop an industry-specific vision. Update and build financial models on the companies and industry you follow. Analyze emerging trends in an industry or macro economy. Assess relative stock valuations and review findings with your team. Build relationships within Sales & Trading and Research. Qualifications and Skills You are pursuing an undergraduate Bachelors degree with a graduation date of December 2026 or Spring 2027. Minimum 3.0 GPA. You have basic knowledge of and a keen interest in finance. You are analytical, adaptive, possess an excellent work ethic, are a leader yet team player, as well as a multi-tasker. You possess proficient oral and written communication skills. Applications will be reviewed on a rolling basis and we encourage you to apply as soon as you are ready. In order to be considered a complete application, students must submit an application and complete a HireVue (instructions emailed upon submission of application). Applications will close on Tuesday, April 15. Expected base pay rates for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Fund Services Summer Analyst Program (New York & Purchase)Institutional Securities GroupNew York, United States of America Job # 18960Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description Overview Morgan Stanley Fund Services (MSFS) is a leading fund administration business with 500 billion assets under administration and 1,000+ professionals across New York, London, Dublin, Glasgow, Mumbai, Bangalore and Hong Kong. MSFS services a global institutional client base, providing hedge funds, multi-asset class investors, family offices and private equity firms with innovative product solutions. Primarily, MSFS provides accounting, investor servicing, reporting, tax, middle and back-office support, and portfolio analytics. MSFS employees work closely with the Chief Operating Officers, Chief Financial Officers, Portfolio Managers and investors of our clients. Duration The MSFS Summer Analyst Program is a 10-week program that begins with one week of classroom training, followed by four rotations across the business. Summer Analysts will be placed with our Investor Services, Middle Office, Product Development and the Anti-Money Laundering team and spend time in both the New York and Purchase offices. All Summer Analysts will receive on-the-job training and exposure to a wide variety of roles, products and services throughout MSFS, working alongside experienced professionals in a fast-paced, client-facing, and market-driven environment. Summer Analysts will have the opportunity to broaden and strengthen their respective skillsets, collaborating with individuals across MSFS on meaningful projects and initiatives. In addition, the Program features a Senior Management Speaker Series, teach-ins, cross-divisional networking events, community service events, performance reviews, and a robust mentorship program. Training Program The program begins with a one-day orientation where Summer Analysts are introduced to the Firm and primary businesses, as well as to one another at our opening Firmwide networking event. For the remainder of training, Summer Analysts will attend divisional-specific events designed to help develop the core skills required for a successful summer. Placements Investor Services (IS): IS works closely with the Investor Relations, Chief Financial Officers, Chief Operating Officers, Compliance teams and investors of our clients. Further, IS supports our clients with investor capital activity (e.g., subscriptions, redemptions, transfers and assignments) and cash movements to and from the client. The IS team is responsible for supporting the fund manager/investor relationship and core responsibilities include onboarding investors, processing investor documents and managing investor communications. Middle Office (MO): The MO team works closely with the Chief Operating Officers, Directors of Operations, and Treasury Managers of our clients to facilitate their Trades Management and/or Cash & Collateral Management needs, including trade processing, positions and cash reconciliations and corporate actions; as well as manage collateral and monitor cash flows. Product Development: Our Product Development team works across MSFS functions to set technology priorities that enhance MSFS products and platforms for our clients. The team works with our clients and colleagues to better understand technology needs and translate those needs to technology requirements that will be used to design new and enhanced products. Anti-Money Laundering (AML): The AML team is responsible for helping our clients identify and manage potential AML risks. The team works closely with the General Counsel, Compliance, and Investor Relations representatives at our clients. Day-to-day responsibilities include the management of AML documentation, serving as a point of contact for fund managers and their investors. Qualifications / Skills / Requirements: Current undergraduate student with a graduation date of December 2026 or Spring 2027 Strong analytical interpersonal, verbal and written communication skills Collaborative, quick learner, adaptable, enjoy solving problems, possess a strong work ethic and ability to multi-task A keen interest in finance and markets Applications will be reviewed on a rolling basis and we encourage you to apply as soon as you are ready. In order to be considered a complete application, students must submit an application and complete a HireVue (instructions emailed upon submission of application). Applications will close on Tuesday, April 15. Expected base pay rate(s) for the role will be 43.27 per hour at the commencement of employment. However, base pay is only part of the total compensation package, which, depending on the position, may also include discretionary bonuses and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Fixed Income Summer Analyst Program (New York)Institutional Securities GroupNew York, United States of America Job # 18957Apply Now(opens in a new tab)                                             Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description The Fixed Income Summer Analyst Program is a 10-week program consisting of one week of classroom training, followed by multiple rotations across Fixed Income. Rotations may include Global Credit & Municipals, Securitized Products, Foreign Exchange/Emerging Markets, Interest Rates, and Commodities. Summer Analysts receive on-the-job training, benefit from working alongside experienced professionals on meaningful projects, and build their skillsets in a dynamic and evolving environment. In addition, the program features a Senior Management Speaker Series, desk teach-ins, networking events, community service, performance reviews, and a robust mentorship program. Program Overview Summer Analysts begin with a one-day orientation where they are introduced to the Firms businesses and learn what its like to be an employee at Morgan Stanley. Fixed Income Summer Analysts then attend Sales & Trading division-specific training where they learn core skills essential for success. The curriculum includes daily market updates, business-specific overviews, and basic product and technical training. Role & Responsibilities Sales: Understand how a client base is developed and maintained; create investment ideas; learn how we sell and cross-sell the Firms products; represent the Firm when interfacing with clients on important business issues. Trading: Assist in generating trade ideas and analysis; support all aspects of the market-making and trade execution process, from providing research analytics on trades to relative value analysis. Strategy: Help develop investment recommendations on Fixed Income Securities through the study and analysis of market fundamentals and technical research. Understand how we use the existing firm model database to develop new models. Structuring: Learn how to build valuation models to help issuers and investors optimize a transactions economics, and quantify sources of value and risk. Qualifications & Skills You are pursuing an undergraduate Bachelors degree (junior) or a Masters with a graduation date of December 2026 or Spring 2027. Minimum 3.0 GPA. While no prior knowledge of finance or sales & trading is required, you must have a keen interest in finance and markets. You are analytical, adaptive, possess a strong work ethic, are a leader yet team player, as well as a multi-tasker. You possess strong oral and written communication skills. Applications will be reviewed on a rolling basis and we encourage you to apply as soon as you are ready. In order to be considered a complete application, students must submit an application and complete a HireVue (instructions emailed upon submission of application). Applications will close on Tuesday, April 15. Expected base pay rates for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More(opens in a new tab)                                              STUDENTS & GRADUATES2026 Institutional Securities Group Risk Management Summer Analyst Program (New York)New York, United States of America Job # 18990Apply Now                                             (opens in a new tab)Application Deadline: Apr 15, 2025Program Type: InternshipProgram Description The Institutional Securities Group Risk Management (ISG Risk) Summer Analyst Program is a 10-week program consisting of one week of classroom training followed by nine weeks of rotations across ISG Risk. ISG Risk is a first line risk management function which includes divisional and ISG Counterparty Risk, ISG Central Risk (CRT), and divisional Business Control Units (BCU). Counterparty risk is responsible for monitoring and managing counterparty risk generated by the ISG businesses at the division and ISG level. ISG Central Risk Team is responsible for creating and implementing the Non-Financial Risk framework centrally across ISG businesses, including, regulatory, supervision, data, cyber, model and trader mandate, ESG and financial crimes risk. Business Control Unit teams work with the Central Risk team and support each business in risk initiatives. Summer Analysts will rotate through a combination of our ISG Counterparty Risk, Central Risk and Business Control Unit teams. The Program features a senior management speaker series, networking events, community service, a performance review and a mentorship program. Summer Analysts receive continued on-the-job training and benefit from working alongside experienced professionals on meaningful projects. In addition to daily responsibilities on the desk, Summer Analysts will be assigned a summer-long project based on their rotations, which is presented to management at the end of the summer. Summer Analysts begin with a one-week orientation where they are introduced to the Firm's businesses and learn what it is like to be an employee at Morgan Stanley. ISG Risk Summer Analysts then attend Sales and Trading division-specific training, accompanied by an additional ISG Risk-focused training day, teaching them core skills essential for a successful summer. The curriculum includes daily market updates, business-specific overviews and basic product and technical training. Qualifications/Skills/Requirements You are pursuing an undergraduate Bachelors or Master's degree with a graduation date of December 2026 or Spring 2027. Minimum 3.0 GPA. You have basic knowledge and a keen interest in finance. You are analytical, adaptive, collaborative, a leader, and a multi-tasker. You possess strong oral and written communication skills. Expected base pay rate for the role will be 52.89 per hour at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs. Morgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees. It is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law. Morgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).Learn More                                             (opens in a new tab) 123...6\n\n\n \n\tThere are currently no opportunities open.Please choose other filters to see different results.\n\tCLEAR ALL FILTERS TO SEE MORE OPPORTUNITIES\n\tRelated Opportunities\n\t\n \n\n\n\n\n\n\n\n\n\n    Filter by\n    \n        X\n        \n    \n\n\n\n\n\n    \n        What are you looking for?\n        Jobs for experienced professionals\n        Lorem ipsum dolor set longer description. Lorem ipsum dolor set logner with here we describe the word.",
  "timestamp": "2025-04-10T02:38:51.529Z",
  "previousTimestamp": "2025-04-02T20:34:43.021Z"
}